<?php  return array (
  'resourceClass' => 'modDocument',
  'resource' => 
  array (
    'id' => 31,
    'type' => 'document',
    'contentType' => 'text/html',
    'pagetitle' => 'Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области',
    'longtitle' => '',
    'description' => 'Как разделить земельный участок или объединить два земельных участка в один во Владимирской области, знают специалисты компании “Гео-Влад”! Обращайтесь к нам по телефону +7(4922)22-20-12',
    'alias' => 'obedinenie-razdel-uchastkov',
    'link_attributes' => '',
    'published' => 1,
    'pub_date' => 0,
    'unpub_date' => 0,
    'parent' => 0,
    'isfolder' => 0,
    'introtext' => '',
    'content' => '<h1>Объединение и раздел земельных участков во Владимире</h1>
<h2>Регистрация земель при слиянии, разделе и перераспределении</h2>
<p>Когда проводится объединение участков, дробление или модификация существующих наделов, фактически получается новая недвижимость. Вышеупомянутые операции применимы лишь к землям, состоящим в реестре государственного кадастра с установленными границами. Наименьшая и наибольшая допустимая площадь, регулируемая законодательно, исходит из категории угодий, вида санкционированного землепользования, генплана градостроения, федеральных правовых актов, постановлений муниципальных органов управления.</p>
<h2>Рассмотрение особенностей модифицирования территорий</h2>
<p>Под перераспределением земель понимают образование новых угодий со смежными границами, но в иной конфигурации. При этом предыдущие участки считают аннулированными. Если процедура применяемая к соседской частной собственности, владельцы присваивают новые имения, размещение и площадь которых предварительно согласовывается. Кадастровые инженеры приглашаются к выполнению подобных работ, когда хозяева земель желают провести новую межу территорий.</p>
<p>При разделе земли возникают новые наделы в пределах границ изначального. Материнские угодья при этом прекращают числиться физически. Владельцу присуждают права на все новообразовавшиеся земли. Произвести раздел земельного участка во Владимире и Владимирской области можно, согласно нижеизложенным указаниям. Дробление земельного удела, относящегося к категории некоммерческих организаций садоводческого, огороднического или дачного характера, проводят согласно проекту застройки местности данной организации, или указанным документом, регулирующим распределение угодий в упомянутом союзе граждан.</p>
<p>Новые земли, возникшие вследствие раздела такого рода угодий предназначаются для садоводства, огородничей деятельности и возведения загородных построек, или же определяются как территории общего пользования. В таком случае, разделенная местность остается существовать в измененных межах. На вопрос, как разделить земельный участок, с готовностью ответят сотрудники компании ООО «Гео Влад», специализирующиеся на кадастровых работах именно во Владимирской области.</p>
<p>Когда производится слияние смежных земель, получаем единый надел, а образовавшие его территории исчезают как объекты недвижимости. В свою очередь владельцу автоматически присваивается новообразованный клочок земли. Совершить объединение земельных участков во Владимире и Владимирской области нужно, когда, к примеру, гражданин, единолично владеющий смежными угодьями, намеревается построить здание или сооружение на рассматриваемой местности. Если владения принадлежат не одному человеку, после слияния образуется право общего имущества, исходящее из гражданских правовых актов. Когда в процессе выясняется, что один из уделов числится в качестве залога, в итоге, новый удел находится под правом залога, если не предвидится иное решение, вытекающее из соглашения сторон.</p>
<h2>Мотивация для изменений структуры наделов</h2>
<p>На сегодня все чаще встречаются ситуации, когда решением случившихся сложностей в управлении земельными делянками предстает слияние, раздел или переформирование существующих угодий. Выделим распространенные причины:</p>
<ul>
<li>развод супругов, после которого надо разделить имущество;</li>
<li>бизнес-решение, принятое руководителем при потребности создания единого участка большей площади из некоторого числа малых клочков земли для возведения на нем построек.</li>
<li>покупка земель для оформления в частные владения и пр.</li>
</ul>
<p>Человеку, нечасто сталкивающемуся с вопросами регистрации наделов, земельного кадастра в целом, трудно организовать весь процесс с минимальными затратами времени и усилий. Снять нагрузку помогут сотрудники ООО «Гео Влад», постоянно работающие в сфере землепользования. Современное законодательство регламентирует любые изменения в структуре и площади наделов, принадлежащих государству и состоящих в частных или муниципальных владениях. Расписаны правила и особенности проведения подобных процедур с уделами, выделяя обязательные моменты:</p>
<ol>
<li>Модификацию надела нельзя осуществить при отсутствии соглашения владельцев, арендующих лиц, землепользователей, держателей залога рассматриваемых уделов, поданного в письменной форме. Оспорить несогласованную ситуацию можно в судовом порядке.</li>
<li>Трансформация государственных и муниципальных территорий возможна на основании решения органов местного или государственного управления. Результат по конкретной ситуации подается по заявке съемщиков или владельцев территорий.</li>
</ol>
<h2>Процедура регистрации новых земельных участков</h2>
<p>Оформление земель, изменяемых структуру представляется трудоемким и сложным процессом, требующим изучения физических и правовых особенностей. Тем не менее, можно заказать раздел участка во Владимире и Владимирской области, делегируя часть обязанностей, что освободит время для других задач. Регистрация состоит из ряда процедур по межеванию, составлению характеристик новой делянки, проводит работы кадастровый инженер, сопровождаемый юристом. Правовед нужен для составления бумаг, используемых при возникновении судебных разбирательств.</p>
<p>Инженер кадастра – основной эксперт, контролирующий:</p>
<ul>
<li>слияние смежных делянок,</li>
<li>перераспределение, разделение одной территории на 2 и более наделов.</li>
</ul>
<p>Тем не менее, статья 11.6 кадастрового законодательства РФ указывает на невозможность слияния смежных делянок, при некоторых видах права собственности. Так, выделяется:</p>
<ul>
<li>право бессрочного использования;</li>
<li>право пожизненно переходящего в наследство имения;</li>
<li>право бесплатного срочного использования.</li>
</ul>
<p>Под исключение попадает случай, в котором все участки с упомянутым выше правом принадлежат единственному владельцу</p>
<p>Во всех вариантах развития ситуации при изменении земель результатом выступает межевой план, составленный по завершению реестровых операций, связанных с формированием уделов. Документ подают при регистрации возникших делянок в территориальном реестре. Чтобы узнать, как объединить два земельных участка в один, достаточно изучить материалы статьи.</p>
<p>Обратите внимание: Подать заявление на регистрацию недвижимого имущества в государственном реестре может любой гражданин, поэтому ООО «Гео Влад» с удовольствием устранит обременительную потребность стоять в очереди учреждения КП, оформив нужные документы от Вашего лица. Плюс, вместе с межевым планом владельцу вручаем сразу и кадастровые паспорта на новообразованные делянки.</p>
<h3>Поэтапная программа действий по оформлению</h3>
<ol>
<li>Принимаем заявление и правовые бумаги</li>
<li>Заключаем соглашение о кадастровых процедурах, оплачивается задаток.</li>
<li>Выполняем предварительные операции, запрашиваем данные в КП и ЕГРП.</li>
<li>Выполняем специфические задачи: проводим геодезическую съемку и межевание.</li>
<li>Анализ сведений, полученных на местности, создание межевого плана и остальных документов.</li>
<li>Уточняются границы надела с соседями.</li>
<li>Сопровождаем прохождение процесса записи информации о делянке в реестр.</li>
</ol>
<h3>Предварительный пакет документов</h3>
<p>Юридическим лицам рекомендуется подготовить для подачи ОГРН, ИНН. Физическим лицам нужно подать паспорт и СНИЛС.</p>
<ol>
<li>Организаторские бумаги заявителя (физлица подают паспорт), уполномоченной личности нужна доверенность, заверенная нотариусом.</li>
<li>Правовые бумаги, подтверждающие владение изначальными земельными участками.</li>
<li>Заказать услуги по объединению земельного участка, осуществлению реестровых операций может один из владельцев. В течение составления межевого плана обязательно нужны подписи всех собственников о согласии на слияние, разделение или перераспределение земель.</li>
</ol>
<h3>Итоги проведенных процедур</h3>
<p>По результатам <a href="kadastrovye-raboty-i-uslugi.php">кадастровых работ</a>, относящихся к разделу границ земельного участка, слиянию или модификации угодий составляются подготовленные сотрудниками ООО «Гео Влад» документы:</p>
<ul>
<li>межевой план;</li>
<li>кадастровый паспорт делянки.</li>
</ul>
<p>Компания "Гео-Влад" выполняет услуги раздела и объединения земельных участков в городах: Муром (Муромский район), Ковров (Ковровский район), Киржач (Киржачский район), Вязники (Вязниковский район), Кольчугино (Кольчугинский район), Гусь-Хрустальный (Гусь-Хрустальный район), Александров (Александровский район), Радужный, Меленки (Меленсковский район), Лакинск (Собинский район), Карабаново (Александровский район), Покров (Петушинский район), Собинка (Собинский район), Юрьев-Польский (Юрьев-Польский район).</p>',
    'richtext' => 1,
    'template' => 5,
    'menuindex' => 30,
    'searchable' => 1,
    'cacheable' => 1,
    'createdby' => 3,
    'createdon' => 1488551974,
    'editedby' => 1,
    'editedon' => 1505121968,
    'deleted' => 0,
    'deletedon' => 0,
    'deletedby' => 0,
    'publishedon' => 1488551940,
    'publishedby' => 3,
    'menutitle' => '',
    'donthit' => 0,
    'privateweb' => 0,
    'privatemgr' => 0,
    'content_dispo' => 0,
    'hidemenu' => 0,
    'class_key' => 'modDocument',
    'context_key' => 'web',
    'content_type' => 1,
    'uri' => 'obedinenie-razdel-uchastkov.php',
    'uri_override' => 0,
    'hide_children_in_tree' => 0,
    'show_in_tree' => 1,
    'properties' => NULL,
    'image' => 
    array (
      0 => 'image',
      1 => 'kadastr/9.jpg',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'price' => 
    array (
      0 => 'price',
      1 => '12000',
      2 => 'default',
      3 => NULL,
      4 => 'number',
    ),
    'rating' => 
    array (
      0 => 'rating',
      1 => '4.4',
      2 => 'default',
      3 => NULL,
      4 => 'listbox',
    ),
    'review' => 
    array (
      0 => 'review',
      1 => '27',
      2 => 'default',
      3 => NULL,
      4 => 'number',
    ),
    'url-list' => 
    array (
      0 => 'url-list',
      1 => '[{"MIGX_id":"2","title":"\\u0423\\u0442\\u043e\\u0447\\u043d\\u0435\\u043d\\u0438\\u0435 \\u0438 \\u0441\\u043e\\u0433\\u043b\\u0430\\u0441\\u043e\\u0432\\u0430\\u043d\\u0438\\u0435 \\u0433\\u0440\\u0430\\u043d\\u0438\\u0446 \\u0437\\u0435\\u043c\\u0435\\u043b\\u044c\\u043d\\u043e\\u0433\\u043e \\u0443\\u0447\\u0430\\u0441\\u0442\\u043a\\u0430","url":"http:\\/\\/geo-vlad.ru\\/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php"},{"MIGX_id":"3","title":"\\u041a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u044b\\u0439 \\u0443\\u0447\\u0435\\u0442 \\u0437\\u0435\\u043c\\u0435\\u043b\\u044c\\u043d\\u043e\\u0433\\u043e \\u0443\\u0447\\u0430\\u0441\\u0442\\u043a\\u0430","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-uchet-uchastka.php"},{"MIGX_id":"4","title":"\\u041a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u044b\\u0439 \\u0443\\u0447\\u0435\\u0442 \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-uchet-nedvizhimosti.php"},{"MIGX_id":"5","title":"\\u041a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u044b\\u0439 \\u0443\\u0447\\u0435\\u0442 \\u043a\\u0432\\u0430\\u0440\\u0442\\u0438\\u0440\\u044b, \\u043c\\u0430\\u0448\\u0438\\u043d\\u043e\\u043c\\u0435\\u0441\\u0442\\u0430, \\u0433\\u0430\\u0440\\u0430\\u0436\\u0430","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-uchet-kvartiry-garazha.php"},{"MIGX_id":"6","title":"\\u041a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u044b\\u0439 \\u0443\\u0447\\u0435\\u0442 \\u0433\\u0430\\u0437\\u043e\\u043f\\u0440\\u043e\\u0432\\u043e\\u0434\\u0430","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-uchet-gazoprovoda.php"},{"MIGX_id":"7","title":"\\u041a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u044b\\u0439 \\u0443\\u0447\\u0435\\u0442 \\u0434\\u043e\\u0440\\u043e\\u0433\\u0438","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-uchet-avtodorog.php"},{"MIGX_id":"8","title":"\\u041c\\u0435\\u0436\\u0435\\u0432\\u043e\\u0439 \\u043f\\u043b\\u0430\\u043d \\u0437\\u0435\\u043c\\u0435\\u043b\\u044c\\u043d\\u043e\\u0433\\u043e \\u0443\\u0447\\u0430\\u0441\\u0442\\u043a\\u0430","url":"http:\\/\\/geo-vlad.ru\\/mezhevoj-plan-mezhevanie.php"},{"MIGX_id":"9","title":"\\u041a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u044b\\u0439 \\u043f\\u043b\\u0430\\u043d \\u0443\\u0447\\u0430\\u0441\\u0442\\u043a\\u0430, \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-plan.php"},{"MIGX_id":"10","title":"\\u041a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u044b\\u0439 \\u043f\\u0430\\u0441\\u043f\\u043e\\u0440\\u0442 \\u0443\\u0447\\u0430\\u0441\\u0442\\u043a\\u0430","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-pasport.php"},{"MIGX_id":"11","title":"\\u041e\\u0444\\u043e\\u0440\\u043c\\u043b\\u0435\\u043d\\u0438\\u0435 \\u0437\\u0435\\u043c\\u0435\\u043b\\u044c\\u043d\\u043e\\u0433\\u043e \\u0443\\u0447\\u0430\\u0441\\u0442\\u043a\\u0430","url":"http:\\/\\/geo-vlad.ru\\/oformlenie-zemelnogo-uchastka.php"},{"MIGX_id":"12","title":"\\u0422\\u0435\\u0445\\u043d\\u0438\\u0447\\u0435\\u0441\\u043a\\u0438\\u0439 \\u043f\\u043b\\u0430\\u043d \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430 \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438","url":"http:\\/\\/geo-vlad.ru\\/tehnicheskij-plan.php"},{"MIGX_id":"13","title":"\\u041e\\u0444\\u043e\\u0440\\u043c\\u043b\\u0435\\u043d\\u0438\\u0435 \\u043a\\u0430\\u0434\\u0430\\u0441\\u0442\\u0440\\u043e\\u0432\\u043e\\u0433\\u043e \\u043d\\u043e\\u043c\\u0435\\u0440\\u0430","url":"http:\\/\\/geo-vlad.ru\\/kadastrovyj-nomer.php"},{"MIGX_id":"14","title":"\\u0410\\u043a\\u0442 \\u043e\\u0431\\u0441\\u043b\\u0435\\u0434\\u043e\\u0432\\u0430\\u043d\\u0438\\u044f \\u0443\\u0447\\u0430\\u0441\\u0442\\u043a\\u0430","url":"http:\\/\\/geo-vlad.ru\\/akt-obsledovanija-uchastka.php"},{"MIGX_id":"15","title":"\\u0410\\u043a\\u0442 \\u043e\\u0431\\u0441\\u043b\\u0435\\u0434\\u043e\\u0432\\u0430\\u043d\\u0438\\u044f \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430","url":"http:\\/\\/geo-vlad.ru\\/akt-obsledovanija-obekta.php"}]',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'list-text' => 
    array (
      0 => 'list-text',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'offer' => 
    array (
      0 => 'offer',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    '_content' => '<!DOCTYPE html>
<html lang="ru-RU">
<head>
<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области</title>
	
	<meta name="description" content="Как разделить земельный участок или объединить два земельных участка в один во Владимирской области, знают специалисты компании “Гео-Влад”! Обращайтесь к нам по телефону +7(4922)22-20-12" />
	
	<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<script src="https://use.fontawesome.com/01c5d59dc9.js"></script>

	
    <link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            
					<li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/geologiya-uchastka.php">Геология участка</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Инженерно-геодезические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-ekologicheskie-izyskanija-vladimir.php">Инженерно-экологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
					<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
					<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
					<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
					<li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы и услуги</a></li>
					<li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php">Уточнение и согласование границ земельного участка</a></li>
					<li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографо-геодезическая съемка</a></li>
					<li><a href="http://geo-vlad.ru/geodezicheskaja-razbivka-osej.php">Геодезическая разбивка осей</a></li>
					<li><a href="http://geo-vlad.ru/gidrogeologicheskie-izyskanija.php">Гидрогеологические и гидрометеорологические изыскания</a></li>
					<li><a href="burenie-skvazhin-na-pesok.php">Бурение на песок</a></li>
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>

<!-- overlay_nav -->
<div class="headers" style="background-image: url(\'./images/kadastr/9.jpg\'); background-size: cover;">
    <div class="container">
        <div class="logo-left">
            <img src="images/logo-vlad1.png" alt="Логотип">
            <p>Весь комплекс инженерных изысканий для<br> строительства <span class="vlad">во Владимирской области:</span></p>
            <a href="#forms" class="big-button">Заказать услугу</a>
        </div>
        
        <div class="hidden">
	       <form id="forms" action="/action-mail.php" method="post" enctype="multipart/form-data" class="popup">
		    <h1>ЗАКАЗАТЬ УСЛУГУ</h1>
		    <p>наш специалист свяжется с Вами в ближайшее время</p>
		    <input type="text" name="name" placeholder="Имя"><br>
		    <i class="fa fa-user" aria-hidden="true"></i>
		    <input type="text" name="phone" placeholder="Телефон *" required="required"><br>
		    <i class="fa fa-mobile" aria-hidden="true"></i>
		    <textarea rows="5" cols="42" name="text" placeholder="Введите текст"></textarea>
		    <button class="btns">Отправить</button>
	       </form>
         </div>
         
         
         
        <div class="logo-right">
            <ul class="home-list list-unstyled">
                <li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
                <li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Геодезические работы</a></li>
                <li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы</a></li>
                <li><a href="inzhenerno-ekologicheskie-izyskanija-vladimir.php">Экологические изыскания</a></li>
                <li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографическая съемка</li>
                <li><a href="geologiya-uchastka.php">Геология участка (исследования грунтов)</a></li>
            </ul>
        </div>
        
        <!--<img src="/images/kadastr/9.jpg" alt="Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области">-->
    </div>
</div>

<!-- BANNER -->
<div class="banner">
    <div class="img_rad"></div>
    <div class="wrapper">
        <strong>АКЦИЯ!</strong>
        <div class="rad_offer">
            Закажите геологические изыскания - и получите измерение радиационного фона на участке <strong>в ПОДАРОК</strong> 
        </div>
        <a href="#" class="but_offer" onclick="getElementById(\'zcwMiniButton\').click()">Заказать звонок</a>
    </div>
</div>    


 <div class="container">
	<ol itemscope itemtype="http://schema.org/BreadcrumbList" class="breadcrumps">
              <li itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="/">
                <span itemprop="name">Главная</span></a>
                <meta itemprop="position" content="1" />
              </li>
              <li itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="/uslugi.php">
                <span itemprop="name">Услуги</span></a>
                <meta itemprop="position" content="2" />
              </li>
			  <li class="visuallyhidden" itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="/ceny.php">
                <span itemprop="name">Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области</span></a>
                <meta itemprop="position" content="3" />
              </li>
              
			  <li itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="obedinenie-razdel-uchastkov.php">
                <span itemprop="name">Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области</span></a>
                <meta itemprop="position" content="4" />
              </li>
            </ol>
</div>
 
<div class="margin-block container content">
<!--Service block -->
<div class="block-img-offer">
    <div class="img-offer">
          <div class="wid-img">
               <img src="/images/kadastr/9.jpg" alt="Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области" title="Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области">
          </div>
          <div class="content-offer"> 
          <p>Цена услуги: <span>от 12000</span></p>
              <span class="off"></span>
              <a href="#forms" class="big-button">Заказать услугу</a>
          </div>
     </div> 
</div>


   

<h1>Объединение и раздел земельных участков во Владимире</h1>
<h2>Регистрация земель при слиянии, разделе и перераспределении</h2>
<p>Когда проводится объединение участков, дробление или модификация существующих наделов, фактически получается новая недвижимость. Вышеупомянутые операции применимы лишь к землям, состоящим в реестре государственного кадастра с установленными границами. Наименьшая и наибольшая допустимая площадь, регулируемая законодательно, исходит из категории угодий, вида санкционированного землепользования, генплана градостроения, федеральных правовых актов, постановлений муниципальных органов управления.</p>
<h2>Рассмотрение особенностей модифицирования территорий</h2>
<p>Под перераспределением земель понимают образование новых угодий со смежными границами, но в иной конфигурации. При этом предыдущие участки считают аннулированными. Если процедура применяемая к соседской частной собственности, владельцы присваивают новые имения, размещение и площадь которых предварительно согласовывается. Кадастровые инженеры приглашаются к выполнению подобных работ, когда хозяева земель желают провести новую межу территорий.</p>
<p>При разделе земли возникают новые наделы в пределах границ изначального. Материнские угодья при этом прекращают числиться физически. Владельцу присуждают права на все новообразовавшиеся земли. Произвести раздел земельного участка во Владимире и Владимирской области можно, согласно нижеизложенным указаниям. Дробление земельного удела, относящегося к категории некоммерческих организаций садоводческого, огороднического или дачного характера, проводят согласно проекту застройки местности данной организации, или указанным документом, регулирующим распределение угодий в упомянутом союзе граждан.</p>
<p>Новые земли, возникшие вследствие раздела такого рода угодий предназначаются для садоводства, огородничей деятельности и возведения загородных построек, или же определяются как территории общего пользования. В таком случае, разделенная местность остается существовать в измененных межах. На вопрос, как разделить земельный участок, с готовностью ответят сотрудники компании ООО «Гео Влад», специализирующиеся на кадастровых работах именно во Владимирской области.</p>
<p>Когда производится слияние смежных земель, получаем единый надел, а образовавшие его территории исчезают как объекты недвижимости. В свою очередь владельцу автоматически присваивается новообразованный клочок земли. Совершить объединение земельных участков во Владимире и Владимирской области нужно, когда, к примеру, гражданин, единолично владеющий смежными угодьями, намеревается построить здание или сооружение на рассматриваемой местности. Если владения принадлежат не одному человеку, после слияния образуется право общего имущества, исходящее из гражданских правовых актов. Когда в процессе выясняется, что один из уделов числится в качестве залога, в итоге, новый удел находится под правом залога, если не предвидится иное решение, вытекающее из соглашения сторон.</p>
<h2>Мотивация для изменений структуры наделов</h2>
<p>На сегодня все чаще встречаются ситуации, когда решением случившихся сложностей в управлении земельными делянками предстает слияние, раздел или переформирование существующих угодий. Выделим распространенные причины:</p>
<ul>
<li>развод супругов, после которого надо разделить имущество;</li>
<li>бизнес-решение, принятое руководителем при потребности создания единого участка большей площади из некоторого числа малых клочков земли для возведения на нем построек.</li>
<li>покупка земель для оформления в частные владения и пр.</li>
</ul>
<p>Человеку, нечасто сталкивающемуся с вопросами регистрации наделов, земельного кадастра в целом, трудно организовать весь процесс с минимальными затратами времени и усилий. Снять нагрузку помогут сотрудники ООО «Гео Влад», постоянно работающие в сфере землепользования. Современное законодательство регламентирует любые изменения в структуре и площади наделов, принадлежащих государству и состоящих в частных или муниципальных владениях. Расписаны правила и особенности проведения подобных процедур с уделами, выделяя обязательные моменты:</p>
<ol>
<li>Модификацию надела нельзя осуществить при отсутствии соглашения владельцев, арендующих лиц, землепользователей, держателей залога рассматриваемых уделов, поданного в письменной форме. Оспорить несогласованную ситуацию можно в судовом порядке.</li>
<li>Трансформация государственных и муниципальных территорий возможна на основании решения органов местного или государственного управления. Результат по конкретной ситуации подается по заявке съемщиков или владельцев территорий.</li>
</ol>
<h2>Процедура регистрации новых земельных участков</h2>
<p>Оформление земель, изменяемых структуру представляется трудоемким и сложным процессом, требующим изучения физических и правовых особенностей. Тем не менее, можно заказать раздел участка во Владимире и Владимирской области, делегируя часть обязанностей, что освободит время для других задач. Регистрация состоит из ряда процедур по межеванию, составлению характеристик новой делянки, проводит работы кадастровый инженер, сопровождаемый юристом. Правовед нужен для составления бумаг, используемых при возникновении судебных разбирательств.</p>
<p>Инженер кадастра – основной эксперт, контролирующий:</p>
<ul>
<li>слияние смежных делянок,</li>
<li>перераспределение, разделение одной территории на 2 и более наделов.</li>
</ul>
<p>Тем не менее, статья 11.6 кадастрового законодательства РФ указывает на невозможность слияния смежных делянок, при некоторых видах права собственности. Так, выделяется:</p>
<ul>
<li>право бессрочного использования;</li>
<li>право пожизненно переходящего в наследство имения;</li>
<li>право бесплатного срочного использования.</li>
</ul>
<p>Под исключение попадает случай, в котором все участки с упомянутым выше правом принадлежат единственному владельцу</p>
<p>Во всех вариантах развития ситуации при изменении земель результатом выступает межевой план, составленный по завершению реестровых операций, связанных с формированием уделов. Документ подают при регистрации возникших делянок в территориальном реестре. Чтобы узнать, как объединить два земельных участка в один, достаточно изучить материалы статьи.</p>
<p>Обратите внимание: Подать заявление на регистрацию недвижимого имущества в государственном реестре может любой гражданин, поэтому ООО «Гео Влад» с удовольствием устранит обременительную потребность стоять в очереди учреждения КП, оформив нужные документы от Вашего лица. Плюс, вместе с межевым планом владельцу вручаем сразу и кадастровые паспорта на новообразованные делянки.</p>
<h3>Поэтапная программа действий по оформлению</h3>
<ol>
<li>Принимаем заявление и правовые бумаги</li>
<li>Заключаем соглашение о кадастровых процедурах, оплачивается задаток.</li>
<li>Выполняем предварительные операции, запрашиваем данные в КП и ЕГРП.</li>
<li>Выполняем специфические задачи: проводим геодезическую съемку и межевание.</li>
<li>Анализ сведений, полученных на местности, создание межевого плана и остальных документов.</li>
<li>Уточняются границы надела с соседями.</li>
<li>Сопровождаем прохождение процесса записи информации о делянке в реестр.</li>
</ol>
<h3>Предварительный пакет документов</h3>
<p>Юридическим лицам рекомендуется подготовить для подачи ОГРН, ИНН. Физическим лицам нужно подать паспорт и СНИЛС.</p>
<ol>
<li>Организаторские бумаги заявителя (физлица подают паспорт), уполномоченной личности нужна доверенность, заверенная нотариусом.</li>
<li>Правовые бумаги, подтверждающие владение изначальными земельными участками.</li>
<li>Заказать услуги по объединению земельного участка, осуществлению реестровых операций может один из владельцев. В течение составления межевого плана обязательно нужны подписи всех собственников о согласии на слияние, разделение или перераспределение земель.</li>
</ol>
<h3>Итоги проведенных процедур</h3>
<p>По результатам <a href="kadastrovye-raboty-i-uslugi.php">кадастровых работ</a>, относящихся к разделу границ земельного участка, слиянию или модификации угодий составляются подготовленные сотрудниками ООО «Гео Влад» документы:</p>
<ul>
<li>межевой план;</li>
<li>кадастровый паспорт делянки.</li>
</ul>
<p>Компания "Гео-Влад" выполняет услуги раздела и объединения земельных участков в городах: Муром (Муромский район), Ковров (Ковровский район), Киржач (Киржачский район), Вязники (Вязниковский район), Кольчугино (Кольчугинский район), Гусь-Хрустальный (Гусь-Хрустальный район), Александров (Александровский район), Радужный, Меленки (Меленсковский район), Лакинск (Собинский район), Карабаново (Александровский район), Покров (Петушинский район), Собинка (Собинский район), Юрьев-Польский (Юрьев-Польский район).</p>

   


    
<div class="block">
    <div class="h2">Смотрите также:</div>
    <ol><b>

                    <li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php" title="Уточнение и согласование границ земельного участка">Уточнение и согласование границ земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-uchastka.php" title="Кадастровый учет земельного участка">Кадастровый учет земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-nedvizhimosti.php" title="Кадастровый учет недвижимости">Кадастровый учет недвижимости</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-kvartiry-garazha.php" title="Кадастровый учет квартиры, машиноместа, гаража">Кадастровый учет квартиры, машиноместа, гаража</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-gazoprovoda.php" title="Кадастровый учет газопровода">Кадастровый учет газопровода</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-avtodorog.php" title="Кадастровый учет дороги">Кадастровый учет дороги</a></li>
                    <li><a href="http://geo-vlad.ru/mezhevoj-plan-mezhevanie.php" title="Межевой план земельного участка">Межевой план земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-plan.php" title="Кадастровый план участка, объекта">Кадастровый план участка, объекта</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-pasport.php" title="Кадастровый паспорт участка">Кадастровый паспорт участка</a></li>
                    <li><a href="http://geo-vlad.ru/oformlenie-zemelnogo-uchastka.php" title="Оформление земельного участка">Оформление земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/tehnicheskij-plan.php" title="Технический план объекта недвижимости">Технический план объекта недвижимости</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-nomer.php" title="Оформление кадастрового номера">Оформление кадастрового номера</a></li>
                    <li><a href="http://geo-vlad.ru/akt-obsledovanija-uchastka.php" title="Акт обследования участка">Акт обследования участка</a></li>
                    <li><a href="http://geo-vlad.ru/akt-obsledovanija-obekta.php" title="Акт обследования объекта">Акт обследования объекта</a></li>
    
    </b></ol>
</div>
    
</div>


<script async type="application/ld+json">
{
  "@context": "http://schema.org/",
  "@type": "Product",
  "name": "Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области",
  "image": "http://geo-vlad.ru/images/kadastr/9.jpg",
  "description": "Как разделить земельный участок или объединить два земельных участка в один во Владимирской области, знают специалисты компании “Гео-Влад”! Обращайтесь к нам по телефону +7(4922)22-20-12",
    "brand": {
    "@type": "Organization",
    "name": "Гео-Влад"
  },
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "4.4",
    "reviewCount": "27"
  },
  "offers": {
    "@type": "Offer",
    "priceCurrency": "RUB",
    "price": "12000.00",
    "priceValidUntil": "2017-12-12",
    "availability": "http://schema.org/InStock",
    "seller": {
      "@type": "Organization",
      "name": "Гео-Влад"
    }
  }
}
</script>

<script async type="application/ld+json">
{ 
    "@context": "http://schema.org/", 
 "@type": "Article",
 "headline": "Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской&#8230;",
 "image": {
          "@type": "ImageObject",
           "contentUrl": "http://geo-vlad.ru/images/images/kadastr/9.jpg",
           "url": "http://geo-vlad.ru/images/images/kadastr/9.jpg",
           "height": "900",
           "width": "1200"
       },
 "author": "Гео-Влад", 
 "mainEntityOfPage": "http://geo-vlad.ru/obedinenie-razdel-uchastkov.php", 
  "publisher": {
      "@type": "Organization",
      "name": "Гео-Влад",
      "logo": {
          "@type": "ImageObject",
           "contentUrl": "http://geo-vlad.ru/images/logo.png",
           "url": "http://geo-vlad.ru/images/logo.png"
       }
    },
 "url": "http://geo-vlad.ru/obedinenie-razdel-uchastkov.php",
 "datePublished": "2017-03-03",
 "dateCreated": "2017-03-03",
 "dateModified": "2017-03-03",
 "description": "Как разделить земельный участок или объединить два земельных участка в один во Владимирской области, знают специалисты компании “Гео-Влад”! Обращайтесь к нам по телефону +7(4922)22-20-12",
 "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "4.4",
    "reviewCount": "27"
  },
 "articleBody": "Объединение и раздел земельных участков во Владимире
<h2>Регистрация земель при слиянии, разделе и перераспределении</h2>
<p>Когда проводится объединение участков, дробление или модификация существующих наделов, фактически получается новая недвижимость. Вышеупомянутые операции применимы лишь к землям, состоящим в реестре государственного кадастра с установленными границами. Наименьшая и наибольшая допустимая площадь, регулируемая законодательно, исходит из категории угодий, вида санкционированного землепользования, генплана градостроения, федеральных правовых актов, постановлений муниципальных органов управления.</p>
<h2>Рассмотрение особенностей модифицирования территорий</h2>
<p>Под перераспределением земель понимают образование новых угодий со смежными границами, но в иной конфигурации. При этом предыдущие участки считают аннулированными. Если процедура применяемая к соседской частной собственности, владельцы присваивают новые имения, размещение и площадь которых предварительно согласовывается. Кадастровые инженеры приглашаются к выполнению подобных работ, когда хозяева земель желают провести новую межу территорий.</p>
<p>При разделе земли возникают новые наделы в пределах границ изначального. Материнские угодья при этом прекращают числиться физически. Владельцу присуждают права на все новообразовавшиеся земли. Произвести раздел земельного участка во Владимире и Владимирской области можно, согласно нижеизложенным указаниям. Дробление земельного удела, относящегося к категории некоммерческих организаций садоводческого, огороднического или дачного характера, проводят согласно проекту застройки местности данной организации, или указанным документом, регулирующим распределение угодий в упомянутом союзе граждан.</p>
<p>Новые земли, возникшие вследствие раздела такого рода угодий предназначаются для садоводства, огородничей деятельности и возведения загородных построек, или же определяются как территории общего пользования. В таком случае, разделенная местность остается существовать в измененных межах. На вопрос, как разделить земельный участок, с готовностью ответят сотрудники компании ООО «Гео Влад», специализирующиеся на кадастровых работах именно во Владимирской области.</p>
<p>Когда производится слияние смежных земель, получаем единый надел, а образовавшие его территории исчезают как объекты недвижимости. В свою очередь владельцу автоматически присваивается новообразованный клочок земли. Совершить объединение земельных участков во Владимире и Владимирской области нужно, когда, к примеру, гражданин, единолично владеющий смежными угодьями, намеревается построить здание или сооружение на рассматриваемой местности. Если владения принадлежат не одному человеку, после слияния образуется право общего имущества, исходящее из гражданских правовых актов. Когда в процессе выясняется, что один из уделов числится в качестве залога, в итоге, новый удел находится под правом залога, если не предвидится иное решение, вытекающее из соглашения сторон.</p>
<h2>Мотивация для изменений структуры наделов</h2>
<p>На сегодня все чаще встречаются ситуации, когда решением случившихся сложностей в управлении земельными делянками предстает слияние, раздел или переформирование существующих угодий. Выделим распространенные причины:</p>
<ul>
<li>развод супругов, после которого надо разделить имущество;</li>
<li>бизнес-решение, принятое руководителем при потребности создания единого участка большей площади из некоторого числа малых клочков земли для возведения на нем построек.</li>
<li>покупка земель для оформления в частные владения и пр.</li>
</ul>
<p>Человеку, нечасто сталкивающемуся с вопросами регистрации наделов, земельного кадастра в целом, трудно организовать весь процесс с минимальными затратами времени и усилий. Снять нагрузку помогут сотрудники ООО «Гео Влад», постоянно работающие в сфере землепользования. Современное законодательство регламентирует любые изменения в структуре и площади наделов, принадлежащих государству и состоящих в частных или муниципальных владениях. Расписаны правила и особенности проведения подобных процедур с уделами, выделяя обязательные моменты:</p>
<ol>
<li>Модификацию надела нельзя осуществить при отсутствии соглашения владельцев, арендующих лиц, землепользователей, держателей залога рассматриваемых уделов, поданного в письменной форме. Оспорить несогласованную ситуацию можно в судовом порядке.</li>
<li>Трансформация государственных и муниципальных территорий возможна на основании решения органов местного или государственного управления. Результат по конкретной ситуации подается по заявке съемщиков или владельцев территорий.</li>
</ol>
<h2>Процедура регистрации новых земельных участков</h2>
<p>Оформление земель, изменяемых структуру представляется трудоемким и сложным процессом, требующим изучения физических и правовых особенностей. Тем не менее, можно заказать раздел участка во Владимире и Владимирской области, делегируя часть обязанностей, что освободит время для других задач. Регистрация состоит из ряда процедур по межеванию, составлению характеристик новой делянки, проводит работы кадастровый инженер, сопровождаемый юристом. Правовед нужен для составления бумаг, используемых при возникновении судебных разбирательств.</p>
<p>Инженер кадастра – основной эксперт, контролирующий:</p>
<ul>
<li>слияние смежных делянок,</li>
<li>перераспределение, разделение одной территории на 2 и более наделов.</li>
</ul>
<p>Тем не менее, статья 11.6 кадастрового законодательства РФ указывает на невозможность слияния смежных делянок, при некоторых видах права собственности. Так, выделяется:</p>
<ul>
<li>право бессрочного использования;</li>
<li>право пожизненно переходящего в наследство имения;</li>
<li>право бесплатного срочного использования.</li>
</ul>
<p>Под исключение попадает случай, в котором все участки с упомянутым выше правом принадлежат единственному владельцу</p>
<p>Во всех вариантах развития ситуации при изменении земель результатом выступает межевой план, составленный по завершению реестровых операций, связанных с формированием уделов. Документ подают при регистрации возникших делянок в территориальном реестре. Чтобы узнать, как объединить два земельных участка в один, достаточно изучить материалы статьи.</p>
<p>Обратите внимание: Подать заявление на регистрацию недвижимого имущества в государственном реестре может любой гражданин, поэтому ООО «Гео Влад» с удовольствием устранит обременительную потребность стоять в очереди учреждения КП, оформив нужные документы от Вашего лица. Плюс, вместе с межевым планом владельцу вручаем сразу и кадастровые паспорта на новообразованные делянки.</p>
<h3>Поэтапная программа действий по оформлению</h3>
<ol>
<li>Принимаем заявление и правовые бумаги</li>
<li>Заключаем соглашение о кадастровых процедурах, оплачивается задаток.</li>
<li>Выполняем предварительные операции, запрашиваем данные в КП и ЕГРП.</li>
<li>Выполняем специфические задачи: проводим геодезическую съемку и межевание.</li>
<li>Анализ сведений, полученных на местности, создание межевого плана и остальных документов.</li>
<li>Уточняются границы надела с соседями.</li>
<li>Сопровождаем прохождение процесса записи информации о делянке в реестр.</li>
</ol>
<h3>Предварительный пакет документов</h3>
<p>Юридическим лицам рекомендуется подготовить для подачи ОГРН, ИНН. Физическим лицам нужно подать паспорт и СНИЛС.</p>
<ol>
<li>Организаторские бумаги заявителя (физлица подают паспорт), уполномоченной личности нужна доверенность, заверенная нотариусом.</li>
<li>Правовые бумаги, подтверждающие владение изначальными земельными участками.</li>
<li>Заказать услуги по объединению земельного участка, осуществлению реестровых операций может один из владельцев. В течение составления межевого плана обязательно нужны подписи всех собственников о согласии на слияние, разделение или перераспределение земель.</li>
</ol>
<h3>Итоги проведенных процедур</h3>
<p>По результатам кадастровых работ, относящихся к разделу границ земельного участка, слиянию или модификации угодий составляются подготовленные сотрудниками ООО «Гео Влад» документы:</p>
<ul>
<li>межевой план;</li>
<li>кадастровый паспорт делянки.</li>
</ul>
<p>Компания \'Гео-Влад\' выполняет услуги раздела и объединения земельных участков в городах: Муром (Муромский район), Ковров (Ковровский район), Киржач (Киржачский район), Вязники (Вязниковский район), Кольчугино (Кольчугинский район), Гусь-Хрустальный (Гусь-Хрустальный район), Александров (Александровский район), Радужный, Меленки (Меленсковский район), Лакинск (Собинский район), Карабаново (Александровский район), Покров (Петушинский район), Собинка (Собинский район), Юрьев-Польский (Юрьев-Польский район).</p>"
 
 }
</script>

    
</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>
<script type="text/javascript">
    $(".big-button").magnificPopup();
</script>


</body>
</html>
	
</body>
</html>',
    '_isForward' => false,
  ),
  'contentType' => 
  array (
    'id' => 1,
    'name' => 'HTML',
    'description' => 'HTML content',
    'mime_type' => 'text/html',
    'file_extensions' => '.php',
    'headers' => NULL,
    'binary' => 0,
  ),
  'policyCache' => 
  array (
  ),
  'elementCache' => 
  array (
    '[[*pagetitle]]' => 'Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской области',
    '[[*description]]' => 'Как разделить земельный участок или объединить два земельных участка в один во Владимирской области, знают специалисты компании “Гео-Влад”! Обращайтесь к нам по телефону +7(4922)22-20-12',
    '[[getImageList? 
            &tvname=`dropdown-list`
            &docid=`1`
            &tpl=`@CODE:
					<li><a href="[[+url]]">[[+title]]</a></li>`
            ]]' => '
					<li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/geologiya-uchastka.php">Геология участка</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Инженерно-геодезические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-ekologicheskie-izyskanija-vladimir.php">Инженерно-экологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
					<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
					<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
					<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
					<li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы и услуги</a></li>
					<li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php">Уточнение и согласование границ земельного участка</a></li>
					<li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографо-геодезическая съемка</a></li>
					<li><a href="http://geo-vlad.ru/geodezicheskaja-razbivka-osej.php">Геодезическая разбивка осей</a></li>
					<li><a href="http://geo-vlad.ru/gidrogeologicheskie-izyskanija.php">Гидрогеологические и гидрометеорологические изыскания</a></li>
					<li><a href="burenie-skvazhin-na-pesok.php">Бурение на песок</a></li>',
    '[[$header]]' => '<link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            
					<li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/geologiya-uchastka.php">Геология участка</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Инженерно-геодезические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-ekologicheskie-izyskanija-vladimir.php">Инженерно-экологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
					<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
					<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
					<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
					<li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы и услуги</a></li>
					<li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php">Уточнение и согласование границ земельного участка</a></li>
					<li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографо-геодезическая съемка</a></li>
					<li><a href="http://geo-vlad.ru/geodezicheskaja-razbivka-osej.php">Геодезическая разбивка осей</a></li>
					<li><a href="http://geo-vlad.ru/gidrogeologicheskie-izyskanija.php">Гидрогеологические и гидрометеорологические изыскания</a></li>
					<li><a href="burenie-skvazhin-na-pesok.php">Бурение на песок</a></li>
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>',
    '[[*image]]' => 'images/kadastr/9.jpg',
    '[[*id]]' => 31,
    '[[~31]]' => 'obedinenie-razdel-uchastkov.php',
    '[[*price]]' => '12000',
    '[[*offer]]' => '',
    '[[getImageList? 
            &tvname=`url-list`
            &tpl=`@CODE:
                    <li><a href="[[+url]]" title="[[+title]]">[[+title]]</a></li>`
            ]]' => '
                    <li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php" title="Уточнение и согласование границ земельного участка">Уточнение и согласование границ земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-uchastka.php" title="Кадастровый учет земельного участка">Кадастровый учет земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-nedvizhimosti.php" title="Кадастровый учет недвижимости">Кадастровый учет недвижимости</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-kvartiry-garazha.php" title="Кадастровый учет квартиры, машиноместа, гаража">Кадастровый учет квартиры, машиноместа, гаража</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-gazoprovoda.php" title="Кадастровый учет газопровода">Кадастровый учет газопровода</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-uchet-avtodorog.php" title="Кадастровый учет дороги">Кадастровый учет дороги</a></li>
                    <li><a href="http://geo-vlad.ru/mezhevoj-plan-mezhevanie.php" title="Межевой план земельного участка">Межевой план земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-plan.php" title="Кадастровый план участка, объекта">Кадастровый план участка, объекта</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-pasport.php" title="Кадастровый паспорт участка">Кадастровый паспорт участка</a></li>
                    <li><a href="http://geo-vlad.ru/oformlenie-zemelnogo-uchastka.php" title="Оформление земельного участка">Оформление земельного участка</a></li>
                    <li><a href="http://geo-vlad.ru/tehnicheskij-plan.php" title="Технический план объекта недвижимости">Технический план объекта недвижимости</a></li>
                    <li><a href="http://geo-vlad.ru/kadastrovyj-nomer.php" title="Оформление кадастрового номера">Оформление кадастрового номера</a></li>
                    <li><a href="http://geo-vlad.ru/akt-obsledovanija-uchastka.php" title="Акт обследования участка">Акт обследования участка</a></li>
                    <li><a href="http://geo-vlad.ru/akt-obsledovanija-obekta.php" title="Акт обследования объекта">Акт обследования объекта</a></li>',
    '[[*list-text]]' => '',
    '[[*rating]]' => '4.4',
    '[[*review]]' => '27',
    '[[*pagetitle:ellipsis=`100`]]' => 'Услуги по объединению земельного участка, заказать раздел границ земельного участка во Владимире и Владимирской&#8230;',
    '[[~31? &scheme=`full`]]' => 'http://geo-vlad.ru/obedinenie-razdel-uchastkov.php',
    '[[*publishedon:strtotime:date=`%Y-%m-%d`]]' => '2017-03-03',
    '[[*content:replace=`"==\'`:strip_tags=`<p>,<h2>,<h3>,<ul>,<ol>,<li>`]]' => 'Объединение и раздел земельных участков во Владимире
<h2>Регистрация земель при слиянии, разделе и перераспределении</h2>
<p>Когда проводится объединение участков, дробление или модификация существующих наделов, фактически получается новая недвижимость. Вышеупомянутые операции применимы лишь к землям, состоящим в реестре государственного кадастра с установленными границами. Наименьшая и наибольшая допустимая площадь, регулируемая законодательно, исходит из категории угодий, вида санкционированного землепользования, генплана градостроения, федеральных правовых актов, постановлений муниципальных органов управления.</p>
<h2>Рассмотрение особенностей модифицирования территорий</h2>
<p>Под перераспределением земель понимают образование новых угодий со смежными границами, но в иной конфигурации. При этом предыдущие участки считают аннулированными. Если процедура применяемая к соседской частной собственности, владельцы присваивают новые имения, размещение и площадь которых предварительно согласовывается. Кадастровые инженеры приглашаются к выполнению подобных работ, когда хозяева земель желают провести новую межу территорий.</p>
<p>При разделе земли возникают новые наделы в пределах границ изначального. Материнские угодья при этом прекращают числиться физически. Владельцу присуждают права на все новообразовавшиеся земли. Произвести раздел земельного участка во Владимире и Владимирской области можно, согласно нижеизложенным указаниям. Дробление земельного удела, относящегося к категории некоммерческих организаций садоводческого, огороднического или дачного характера, проводят согласно проекту застройки местности данной организации, или указанным документом, регулирующим распределение угодий в упомянутом союзе граждан.</p>
<p>Новые земли, возникшие вследствие раздела такого рода угодий предназначаются для садоводства, огородничей деятельности и возведения загородных построек, или же определяются как территории общего пользования. В таком случае, разделенная местность остается существовать в измененных межах. На вопрос, как разделить земельный участок, с готовностью ответят сотрудники компании ООО «Гео Влад», специализирующиеся на кадастровых работах именно во Владимирской области.</p>
<p>Когда производится слияние смежных земель, получаем единый надел, а образовавшие его территории исчезают как объекты недвижимости. В свою очередь владельцу автоматически присваивается новообразованный клочок земли. Совершить объединение земельных участков во Владимире и Владимирской области нужно, когда, к примеру, гражданин, единолично владеющий смежными угодьями, намеревается построить здание или сооружение на рассматриваемой местности. Если владения принадлежат не одному человеку, после слияния образуется право общего имущества, исходящее из гражданских правовых актов. Когда в процессе выясняется, что один из уделов числится в качестве залога, в итоге, новый удел находится под правом залога, если не предвидится иное решение, вытекающее из соглашения сторон.</p>
<h2>Мотивация для изменений структуры наделов</h2>
<p>На сегодня все чаще встречаются ситуации, когда решением случившихся сложностей в управлении земельными делянками предстает слияние, раздел или переформирование существующих угодий. Выделим распространенные причины:</p>
<ul>
<li>развод супругов, после которого надо разделить имущество;</li>
<li>бизнес-решение, принятое руководителем при потребности создания единого участка большей площади из некоторого числа малых клочков земли для возведения на нем построек.</li>
<li>покупка земель для оформления в частные владения и пр.</li>
</ul>
<p>Человеку, нечасто сталкивающемуся с вопросами регистрации наделов, земельного кадастра в целом, трудно организовать весь процесс с минимальными затратами времени и усилий. Снять нагрузку помогут сотрудники ООО «Гео Влад», постоянно работающие в сфере землепользования. Современное законодательство регламентирует любые изменения в структуре и площади наделов, принадлежащих государству и состоящих в частных или муниципальных владениях. Расписаны правила и особенности проведения подобных процедур с уделами, выделяя обязательные моменты:</p>
<ol>
<li>Модификацию надела нельзя осуществить при отсутствии соглашения владельцев, арендующих лиц, землепользователей, держателей залога рассматриваемых уделов, поданного в письменной форме. Оспорить несогласованную ситуацию можно в судовом порядке.</li>
<li>Трансформация государственных и муниципальных территорий возможна на основании решения органов местного или государственного управления. Результат по конкретной ситуации подается по заявке съемщиков или владельцев территорий.</li>
</ol>
<h2>Процедура регистрации новых земельных участков</h2>
<p>Оформление земель, изменяемых структуру представляется трудоемким и сложным процессом, требующим изучения физических и правовых особенностей. Тем не менее, можно заказать раздел участка во Владимире и Владимирской области, делегируя часть обязанностей, что освободит время для других задач. Регистрация состоит из ряда процедур по межеванию, составлению характеристик новой делянки, проводит работы кадастровый инженер, сопровождаемый юристом. Правовед нужен для составления бумаг, используемых при возникновении судебных разбирательств.</p>
<p>Инженер кадастра – основной эксперт, контролирующий:</p>
<ul>
<li>слияние смежных делянок,</li>
<li>перераспределение, разделение одной территории на 2 и более наделов.</li>
</ul>
<p>Тем не менее, статья 11.6 кадастрового законодательства РФ указывает на невозможность слияния смежных делянок, при некоторых видах права собственности. Так, выделяется:</p>
<ul>
<li>право бессрочного использования;</li>
<li>право пожизненно переходящего в наследство имения;</li>
<li>право бесплатного срочного использования.</li>
</ul>
<p>Под исключение попадает случай, в котором все участки с упомянутым выше правом принадлежат единственному владельцу</p>
<p>Во всех вариантах развития ситуации при изменении земель результатом выступает межевой план, составленный по завершению реестровых операций, связанных с формированием уделов. Документ подают при регистрации возникших делянок в территориальном реестре. Чтобы узнать, как объединить два земельных участка в один, достаточно изучить материалы статьи.</p>
<p>Обратите внимание: Подать заявление на регистрацию недвижимого имущества в государственном реестре может любой гражданин, поэтому ООО «Гео Влад» с удовольствием устранит обременительную потребность стоять в очереди учреждения КП, оформив нужные документы от Вашего лица. Плюс, вместе с межевым планом владельцу вручаем сразу и кадастровые паспорта на новообразованные делянки.</p>
<h3>Поэтапная программа действий по оформлению</h3>
<ol>
<li>Принимаем заявление и правовые бумаги</li>
<li>Заключаем соглашение о кадастровых процедурах, оплачивается задаток.</li>
<li>Выполняем предварительные операции, запрашиваем данные в КП и ЕГРП.</li>
<li>Выполняем специфические задачи: проводим геодезическую съемку и межевание.</li>
<li>Анализ сведений, полученных на местности, создание межевого плана и остальных документов.</li>
<li>Уточняются границы надела с соседями.</li>
<li>Сопровождаем прохождение процесса записи информации о делянке в реестр.</li>
</ol>
<h3>Предварительный пакет документов</h3>
<p>Юридическим лицам рекомендуется подготовить для подачи ОГРН, ИНН. Физическим лицам нужно подать паспорт и СНИЛС.</p>
<ol>
<li>Организаторские бумаги заявителя (физлица подают паспорт), уполномоченной личности нужна доверенность, заверенная нотариусом.</li>
<li>Правовые бумаги, подтверждающие владение изначальными земельными участками.</li>
<li>Заказать услуги по объединению земельного участка, осуществлению реестровых операций может один из владельцев. В течение составления межевого плана обязательно нужны подписи всех собственников о согласии на слияние, разделение или перераспределение земель.</li>
</ol>
<h3>Итоги проведенных процедур</h3>
<p>По результатам кадастровых работ, относящихся к разделу границ земельного участка, слиянию или модификации угодий составляются подготовленные сотрудниками ООО «Гео Влад» документы:</p>
<ul>
<li>межевой план;</li>
<li>кадастровый паспорт делянки.</li>
</ul>
<p>Компания \'Гео-Влад\' выполняет услуги раздела и объединения земельных участков в городах: Муром (Муромский район), Ковров (Ковровский район), Киржач (Киржачский район), Вязники (Вязниковский район), Кольчугино (Кольчугинский район), Гусь-Хрустальный (Гусь-Хрустальный район), Александров (Александровский район), Радужный, Меленки (Меленсковский район), Лакинск (Собинский район), Карабаново (Александровский район), Покров (Петушинский район), Собинка (Собинский район), Юрьев-Польский (Юрьев-Польский район).</p>',
    '[[$footer]]' => '</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>',
  ),
  'sourceCache' => 
  array (
    'modChunk' => 
    array (
      'header' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'header',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            [[getImageList? 
            &tvname=`dropdown-list`
            &docid=`1`
            &tpl=`@CODE:
					<li><a href="[[+url]]">[[+title]]</a></li>`
            ]]
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            [[getImageList? 
            &tvname=`dropdown-list`
            &docid=`1`
            &tpl=`@CODE:
					<li><a href="[[+url]]">[[+title]]</a></li>`
            ]]
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'footer' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'footer',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modSnippet' => 
    array (
      'getImageList' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'getImageList',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\',$inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }
        
        if (empty($outputvalue)){
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)){
                foreach ($inheritFrom as $from){
                    if ($from == \'parents\'){
                        $outputvalue = $tv->processInheritBinding(\'\',$docid);
                    }else{
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)){
                        break;
                    }                    
                }
            }
        }

       
        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)){
            $migx->source->initialize();
        }
        
    }


}

if (empty($outputvalue)) {
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\',$inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }
        
        if (empty($outputvalue)){
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)){
                foreach ($inheritFrom as $from){
                    if ($from == \'parents\'){
                        $outputvalue = $tv->processInheritBinding(\'\',$docid);
                    }else{
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)){
                        break;
                    }                    
                }
            }
        }

       
        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)){
            $migx->source->initialize();
        }
        
    }


}

if (empty($outputvalue)) {
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
    ),
    'modTemplateVar' => 
    array (
      'image' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'image',
          'caption' => 'Путь к картинке для статьи',
          'description' => 'Инженерно-геологические изыскания для строительства',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => 'bg1.jpg',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => 'bg1.jpg',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'price' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'number',
          'name' => 'price',
          'caption' => 'Цена услуги',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '24000',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'allowDecimals' => 'Да',
            'allowNegative' => 'Нет',
            'decimalPrecision' => '2',
            'decimalSeparator' => '.',
            'maxValue' => '',
            'minValue' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '24000',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'offer' => 
      array (
        'fields' => 
        array (
          'id' => 13,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'offer',
          'caption' => 'Спецпредложение',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'maxLength' => '',
            'minLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'list-text' => 
      array (
        'fields' => 
        array (
          'id' => 6,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'list-text',
          'caption' => 'HTML-код для списка ссылок на статьи',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'rating' => 
      array (
        'fields' => 
        array (
          'id' => 3,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'listbox',
          'name' => 'rating',
          'caption' => 'Рейтинг от 0 до 5',
          'description' => 'Любое значение от 4 до 5',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '4.1||4.2||4.3||4.4||4.5||4.6||4.7||4.8||4.9
',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '4.5',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'listWidth' => '',
            'title' => '',
            'typeAhead' => 'false',
            'typeAheadDelay' => '250',
            'forceSelection' => 'false',
            'listEmptyText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '4.5',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'review' => 
      array (
        'fields' => 
        array (
          'id' => 4,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'number',
          'name' => 'review',
          'caption' => 'Количество отзывов',
          'description' => 'Любое целое число от 10 до 40',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '27',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'allowDecimals' => 'Нет',
            'allowNegative' => 'Нет',
            'decimalPrecision' => '2',
            'decimalSeparator' => '.',
            'maxValue' => '40',
            'minValue' => '10',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '27',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
  ),
);