<?php  return array (
  'resourceClass' => 'modDocument',
  'resource' => 
  array (
    'id' => 53,
    'type' => 'document',
    'contentType' => 'text/html',
    'pagetitle' => 'Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области',
    'longtitle' => '',
    'description' => 'Локальный экологический мониторинг, программа проведения производственного экологического контроля мониторинга окружающей среды - расценки во Владимирской области узнавайте в компании “Гео-Влад” по телефону +7(4922)22-20-12!',
    'alias' => 'ekologicheskij-monitoring-okruzhajushhej-sredy',
    'link_attributes' => '',
    'published' => 1,
    'pub_date' => 0,
    'unpub_date' => 0,
    'parent' => 0,
    'isfolder' => 0,
    'introtext' => '',
    'content' => '<h1>Что необходимо для проведения экологического мониторинга во Владимире и Владимирской области?</h1>
<p>Экологический контроль производится в нашей стране на основе проведения специального мониторинга. В общем речь идет об определенном анализе внешнего окружения. Для того, чтобы процедура отличалась правдоподобностью и правильностью оформления, рекомендуется обращаться к проверенным специалистам. ООО "Гео Влад" осуществляет экологический контроль и мониторинг во Владимире и Владимирской области. Что же именно подразумевает это исследование, и каковы его виды, основные отличия?</p>
<h2>Понятие экологического контроля и мониторинга</h2>
<p>Экологический мониторинг необходим для выявления проблем эколого-хозяйственного районирования, а также проверки правдивости и актуальности существующих данных об экологической ситуации территории. ООО "Гео Влад" предлагает экологический мониторинг окружающей среды во Владимире и Владимирской области. В наши обязанности будет входить составление наблюдения состояния окружающей среды, оценивание и прогнозирование ее будущего состояния в результате влияния определенных факторов, соответственно, выявление этих факторов и общее подсчитывание результатов.</p>
<p>Произведение всех работ должно осуществляться в соответствии с определенным алгоритмом, и требует заключения в виде правильного оформления документа. В связи с этим существует программа экологического мониторинга окружающей среды во Владимире и Владимирской области.</p>
<p>Какие пункты включает в себя эта программа?</p>
<ol>
<li>Параметрическую организацию экологического мониторинга (значения контроля содержания веществ в воздухе, грунте, воде).</li>
<li>Хорологисческую организацию мониторинга (перечень специфических, с точки зрения экологии, объектов).</li>
<li>Хронологическую организацию мониторинга (речь идет о частоте проведения проверок, наличие повторных исследований и так далее).</li>
<li>Приложения в виде разработанных карт, таблиц, схем.</li>
</ol>
<h3>Виды экологического мониторинга</h3>
<p>Для обследования определенного участка территории существует такое понятие, как локальный экологический мониторинг. К примеру, заказчик желает исследовать природоохранную территорию или зону экологического бедствия. Также может быть осмотрены лишь части какого-либо объекта.</p>
<p>Кроме того, существует такой вид мониторинга, как производственный контроль. Он предусматривает подтверждение (или опровержение) проводимости определенных действий касательно поддержания надлежащего состояния окружающей среды, принятие мер по улучшению этого состояния, а также приложение усилий к организации рационального пользования предоставленными природными ресурсами, соответствие предпринимаемых действий требованиям законодательства.</p>
<p>Программа производственного экологического контроля может включать следующие положения:</p>
<ul>
<li>инвентаризация выбросов в прилегающую окружающую среду (атмосферу, водные ресурсы, грунтовой покров);</li>
<li>инвентаризация объемов и мест концентрации отходов производства;</li>
<li>информация о должностных лицах, несущих ответственность за способ обращения с опасными для экологии отходами;</li>
<li>информация о наличии собственных исследовательских учреждений и соответствие их деятельности с законодательными положениями Российской Федерации;</li>
<li>данные о проводимых исследованиях территории, взятие проб и так далее.</li>
</ul>
<p>Сущность экологического мониторинга почв объясняет само название. Как правило, требуется для успешного проведения сельскохозяйственной деятельности в сфере аграрного бизнеса. В процессе составления результатов значения имеют факторы воздействия (биологические, химические, физические). Необходимо наличие следующей информации:</p>
<ul>
<li>доказательство контроля предприятия (фирмы, компании) за почвенным плодородием;</li>
<li>утверждение и применение мероприятий по улучшению состояния наиболее уязвимых сортов почвы;</li>
<li>прогнозирование состояния грунта, указание на влияние определенных факторов, которые могут поспособствовать тому или иному результату;</li>
<li>исследование малейших изменений земляного покрова;</li>
<li>рассмотрение влияния близлежащих грунтов и сравнение их состояний.</li>
</ul>
<p>В предпринимательской деятельности человек может столкнуться с экологическим мониторингом предприятия во Владимире и Владимирской области. Прежде всего, от учреждения требуется внедрение систем экологического менеджмента, что достигается путем предоставления таких документов:</p>
<ul>
<li>проекта лимита размещения отходов;</li>
<li>порядка и места их размещения;</li>
<li>проекта допустимых выбросов в соответствии с установленными нормами;</li>
<li>в случае произведения выбросов в водоемы - оговорить эти условия.</li>
</ul>
<p>На основе вышеперечисленных данных формируется программа производственного экологического контроля, мониторинга, с расценками которых вы можете ознакомится обратившись к нашему специалисту. В дальнейшем осуществляется непосредственный процесс мониторинга. Кроме того, каждый предприниматель должен иметь так называемый экологический паспорт, в котором также фиксируются данные о проведении производственного экологического мониторинга.</p>
<p>Что касается такой сферы, как строительство, то в этом плане также важно проведение правильных <a href="inzhenerno-ekologicheskie-izyskanija-vladimir.php">экологических исследований</a>, и на их основе - работ.</p>
<h3>В каких случаях необходим экологический мониторинг строительства во Владимире и Владимирской области?</h3>
<ul>
<li>во время сооружения сетей коммуникаций;</li>
<li>во время строения как жилых, так и нежилых помещений;</li>
<li>в период прокладывания авто- и железных дорог;</li>
<li>в период обустройства общественных мест - парков, скверов и так далее.</li>
</ul>
<p>Расценка на вышеперечисленные услуги зависит от масштабов проводимых работ. С более детальной информацией вы можете ознакомиться, обратившись к нашим специалистам. Ждем ваших заказов!</p>
<p>Компания "Гео-Влад" проводит экологический мониторинг и прочие <a href="/#ingenerno-geologicheskie">инженерные изыскания</a> в городах:</p>
<ul>
<li>Муром (Муромский район);</li>
<li>Ковров (Ковровский район);</li>
<li>Вязники (Вязниковский район);</li>
<li>Кольчугино (Кольчугинский район);</li>
<li>Гусь-Хрустальный (Гусь-Хрустальный район);</li>
<li>Александров (Александровский район);</li>
<li>Радужный, Меленки (Меленсковский район);</li>
<li>Лакинск (Собинский район);</li>
<li>Карабаново (Александровский район);</li>
<li>Покров (Петушинский район);</li>
<li>Собинка (Собинский район);</li>
<li>Юрьев-Польский (Юрьев-Польский район).
</ul>',
    'richtext' => 1,
    'template' => 5,
    'menuindex' => 52,
    'searchable' => 1,
    'cacheable' => 1,
    'createdby' => 3,
    'createdon' => 1490696374,
    'editedby' => 1,
    'editedon' => 1511185527,
    'deleted' => 0,
    'deletedon' => 0,
    'deletedby' => 0,
    'publishedon' => 1490696340,
    'publishedby' => 3,
    'menutitle' => '',
    'donthit' => 0,
    'privateweb' => 0,
    'privatemgr' => 0,
    'content_dispo' => 0,
    'hidemenu' => 0,
    'class_key' => 'modDocument',
    'context_key' => 'web',
    'content_type' => 1,
    'uri' => 'ekologicheskij-monitoring-okruzhajushhej-sredy.php',
    'uri_override' => 0,
    'hide_children_in_tree' => 0,
    'show_in_tree' => 1,
    'properties' => NULL,
    'image' => 
    array (
      0 => 'image',
      1 => 'ecology/6.jpg',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'price' => 
    array (
      0 => 'price',
      1 => '65000',
      2 => 'default',
      3 => NULL,
      4 => 'number',
    ),
    'rating' => 
    array (
      0 => 'rating',
      1 => '4.5',
      2 => 'default',
      3 => NULL,
      4 => 'listbox',
    ),
    'review' => 
    array (
      0 => 'review',
      1 => '20',
      2 => 'default',
      3 => NULL,
      4 => 'number',
    ),
    'url-list' => 
    array (
      0 => 'url-list',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'list-text' => 
    array (
      0 => 'list-text',
      1 => '<li><a href="http://geo-vlad.ru/perechen-meroprijatij-po-ohrane-okruzhajushhej-sredy-vladimir.php">Перечень мероприятий по охране окружающей среды ПМООС</a></li>
<li><a href="http://geo-vlad.ru/ocenka-vozdejstvija-na-okruzhajushhuju-sredu-ovos-vladimir.php">Оценка воздействия на окружающую среду ОВОС</a></li>
<li><a href="http://geo-vlad.ru/provedenie-ekologicheskoj-ekspertizy.php">Проведение экологической экспертизы</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskij-audit.php">Экологический аудит</a></li>
<li><a href="http://geo-vlad.ru/otchety-po-ekologii.php">Отчеты по экологии</a></li>
<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskie-laboratornye-issledovanija.php">Экологические лабораторные исследования</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskie-uslugi.php">Экологические услуги</a></li>',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'offer' => 
    array (
      0 => 'offer',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    '_content' => '<!DOCTYPE html>
<html lang="ru-RU">
<head>
<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области</title>
	
	<meta name="description" content="Локальный экологический мониторинг, программа проведения производственного экологического контроля мониторинга окружающей среды - расценки во Владимирской области узнавайте в компании “Гео-Влад” по телефону +7(4922)22-20-12!" />
	
	<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<script src="https://use.fontawesome.com/01c5d59dc9.js"></script>

	
    <link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            
					<li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/geologiya-uchastka.php">Геология участка</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Инженерно-геодезические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-ekologicheskie-izyskanija-vladimir.php">Инженерно-экологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
					<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
					<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
					<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
					<li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы и услуги</a></li>
					<li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php">Уточнение и согласование границ земельного участка</a></li>
					<li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографо-геодезическая съемка</a></li>
					<li><a href="http://geo-vlad.ru/geodezicheskaja-razbivka-osej.php">Геодезическая разбивка осей</a></li>
					<li><a href="http://geo-vlad.ru/gidrogeologicheskie-izyskanija.php">Гидрогеологические и гидрометеорологические изыскания</a></li>
					<li><a href="burenie-skvazhin-na-pesok.php">Бурение на песок</a></li>
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>

<!-- overlay_nav -->
<div class="headers" style="background-image: url(\'./images/ecology/6.jpg\'); background-size: cover;">
    <div class="container">
        <div class="logo-left">
            <img src="images/logo-vlad1.png" alt="Логотип">
            <p>Весь комплекс инженерных изысканий для<br> строительства <span class="vlad">во Владимирской области:</span></p>
            <a href="#forms" class="big-button">Заказать услугу</a>
        </div>
        
        <div class="hidden">
	       <form id="forms" action="/action-mail.php" method="post" enctype="multipart/form-data" class="popup">
		    <h1>ЗАКАЗАТЬ УСЛУГУ</h1>
		    <p>наш специалист свяжется с Вами в ближайшее время</p>
		    <input type="text" name="name" placeholder="Имя"><br>
		    <i class="fa fa-user" aria-hidden="true"></i>
		    <input type="text" name="phone" placeholder="Телефон *" required="required"><br>
		    <i class="fa fa-mobile" aria-hidden="true"></i>
		    <textarea rows="5" cols="42" name="text" placeholder="Введите текст"></textarea>
		    <button class="btns">Отправить</button>
	       </form>
         </div>
         
         
         
        <div class="logo-right">
            <ul class="home-list list-unstyled">
                <li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
                <li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Геодезические работы</a></li>
                <li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы</a></li>
                <li><a href="inzhenerno-ekologicheskie-izyskanija-vladimir.php">Экологические изыскания</a></li>
                <li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографическая съемка</li>
                <li><a href="geologiya-uchastka.php">Геология участка (исследования грунтов)</a></li>
            </ul>
        </div>
        
        <!--<img src="/images/ecology/6.jpg" alt="Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области">-->
    </div>
</div>

<!-- BANNER -->
<div class="banner">
    <div class="img_rad"></div>
    <div class="wrapper">
        <strong>АКЦИЯ!</strong>
        <div class="rad_offer">
            Закажите геологические изыскания - и получите измерение радиационного фона на участке <strong>в ПОДАРОК</strong> 
        </div>
        <a href="#" class="but_offer" onclick="getElementById(\'zcwMiniButton\').click()">Заказать звонок</a>
    </div>
</div>    


 <div class="container">
	<ol itemscope itemtype="http://schema.org/BreadcrumbList" class="breadcrumps">
              <li itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="/">
                <span itemprop="name">Главная</span></a>
                <meta itemprop="position" content="1" />
              </li>
              <li itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="/uslugi.php">
                <span itemprop="name">Услуги</span></a>
                <meta itemprop="position" content="2" />
              </li>
			  <li class="visuallyhidden" itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="/ceny.php">
                <span itemprop="name">Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области</span></a>
                <meta itemprop="position" content="3" />
              </li>
              
			  <li itemprop="itemListElement" itemscope
                  itemtype="http://schema.org/ListItem">
                <a itemprop="item" href="ekologicheskij-monitoring-okruzhajushhej-sredy.php">
                <span itemprop="name">Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области</span></a>
                <meta itemprop="position" content="4" />
              </li>
            </ol>
</div>
 
<div class="margin-block container content">
<!--Service block -->
<div class="block-img-offer">
    <div class="img-offer">
          <div class="wid-img">
               <img src="/images/ecology/6.jpg" alt="Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области" title="Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области">
          </div>
          <div class="content-offer"> 
          <p>Цена услуги: <span>от 65000</span></p>
              <span class="off"></span>
              <a href="#forms" class="big-button">Заказать услугу</a>
          </div>
     </div> 
</div>


   

<h1>Что необходимо для проведения экологического мониторинга во Владимире и Владимирской области?</h1>
<p>Экологический контроль производится в нашей стране на основе проведения специального мониторинга. В общем речь идет об определенном анализе внешнего окружения. Для того, чтобы процедура отличалась правдоподобностью и правильностью оформления, рекомендуется обращаться к проверенным специалистам. ООО "Гео Влад" осуществляет экологический контроль и мониторинг во Владимире и Владимирской области. Что же именно подразумевает это исследование, и каковы его виды, основные отличия?</p>
<h2>Понятие экологического контроля и мониторинга</h2>
<p>Экологический мониторинг необходим для выявления проблем эколого-хозяйственного районирования, а также проверки правдивости и актуальности существующих данных об экологической ситуации территории. ООО "Гео Влад" предлагает экологический мониторинг окружающей среды во Владимире и Владимирской области. В наши обязанности будет входить составление наблюдения состояния окружающей среды, оценивание и прогнозирование ее будущего состояния в результате влияния определенных факторов, соответственно, выявление этих факторов и общее подсчитывание результатов.</p>
<p>Произведение всех работ должно осуществляться в соответствии с определенным алгоритмом, и требует заключения в виде правильного оформления документа. В связи с этим существует программа экологического мониторинга окружающей среды во Владимире и Владимирской области.</p>
<p>Какие пункты включает в себя эта программа?</p>
<ol>
<li>Параметрическую организацию экологического мониторинга (значения контроля содержания веществ в воздухе, грунте, воде).</li>
<li>Хорологисческую организацию мониторинга (перечень специфических, с точки зрения экологии, объектов).</li>
<li>Хронологическую организацию мониторинга (речь идет о частоте проведения проверок, наличие повторных исследований и так далее).</li>
<li>Приложения в виде разработанных карт, таблиц, схем.</li>
</ol>
<h3>Виды экологического мониторинга</h3>
<p>Для обследования определенного участка территории существует такое понятие, как локальный экологический мониторинг. К примеру, заказчик желает исследовать природоохранную территорию или зону экологического бедствия. Также может быть осмотрены лишь части какого-либо объекта.</p>
<p>Кроме того, существует такой вид мониторинга, как производственный контроль. Он предусматривает подтверждение (или опровержение) проводимости определенных действий касательно поддержания надлежащего состояния окружающей среды, принятие мер по улучшению этого состояния, а также приложение усилий к организации рационального пользования предоставленными природными ресурсами, соответствие предпринимаемых действий требованиям законодательства.</p>
<p>Программа производственного экологического контроля может включать следующие положения:</p>
<ul>
<li>инвентаризация выбросов в прилегающую окружающую среду (атмосферу, водные ресурсы, грунтовой покров);</li>
<li>инвентаризация объемов и мест концентрации отходов производства;</li>
<li>информация о должностных лицах, несущих ответственность за способ обращения с опасными для экологии отходами;</li>
<li>информация о наличии собственных исследовательских учреждений и соответствие их деятельности с законодательными положениями Российской Федерации;</li>
<li>данные о проводимых исследованиях территории, взятие проб и так далее.</li>
</ul>
<p>Сущность экологического мониторинга почв объясняет само название. Как правило, требуется для успешного проведения сельскохозяйственной деятельности в сфере аграрного бизнеса. В процессе составления результатов значения имеют факторы воздействия (биологические, химические, физические). Необходимо наличие следующей информации:</p>
<ul>
<li>доказательство контроля предприятия (фирмы, компании) за почвенным плодородием;</li>
<li>утверждение и применение мероприятий по улучшению состояния наиболее уязвимых сортов почвы;</li>
<li>прогнозирование состояния грунта, указание на влияние определенных факторов, которые могут поспособствовать тому или иному результату;</li>
<li>исследование малейших изменений земляного покрова;</li>
<li>рассмотрение влияния близлежащих грунтов и сравнение их состояний.</li>
</ul>
<p>В предпринимательской деятельности человек может столкнуться с экологическим мониторингом предприятия во Владимире и Владимирской области. Прежде всего, от учреждения требуется внедрение систем экологического менеджмента, что достигается путем предоставления таких документов:</p>
<ul>
<li>проекта лимита размещения отходов;</li>
<li>порядка и места их размещения;</li>
<li>проекта допустимых выбросов в соответствии с установленными нормами;</li>
<li>в случае произведения выбросов в водоемы - оговорить эти условия.</li>
</ul>
<p>На основе вышеперечисленных данных формируется программа производственного экологического контроля, мониторинга, с расценками которых вы можете ознакомится обратившись к нашему специалисту. В дальнейшем осуществляется непосредственный процесс мониторинга. Кроме того, каждый предприниматель должен иметь так называемый экологический паспорт, в котором также фиксируются данные о проведении производственного экологического мониторинга.</p>
<p>Что касается такой сферы, как строительство, то в этом плане также важно проведение правильных <a href="inzhenerno-ekologicheskie-izyskanija-vladimir.php">экологических исследований</a>, и на их основе - работ.</p>
<h3>В каких случаях необходим экологический мониторинг строительства во Владимире и Владимирской области?</h3>
<ul>
<li>во время сооружения сетей коммуникаций;</li>
<li>во время строения как жилых, так и нежилых помещений;</li>
<li>в период прокладывания авто- и железных дорог;</li>
<li>в период обустройства общественных мест - парков, скверов и так далее.</li>
</ul>
<p>Расценка на вышеперечисленные услуги зависит от масштабов проводимых работ. С более детальной информацией вы можете ознакомиться, обратившись к нашим специалистам. Ждем ваших заказов!</p>
<p>Компания "Гео-Влад" проводит экологический мониторинг и прочие <a href="/#ingenerno-geologicheskie">инженерные изыскания</a> в городах:</p>
<ul>
<li>Муром (Муромский район);</li>
<li>Ковров (Ковровский район);</li>
<li>Вязники (Вязниковский район);</li>
<li>Кольчугино (Кольчугинский район);</li>
<li>Гусь-Хрустальный (Гусь-Хрустальный район);</li>
<li>Александров (Александровский район);</li>
<li>Радужный, Меленки (Меленсковский район);</li>
<li>Лакинск (Собинский район);</li>
<li>Карабаново (Александровский район);</li>
<li>Покров (Петушинский район);</li>
<li>Собинка (Собинский район);</li>
<li>Юрьев-Польский (Юрьев-Польский район).
</ul>

   


    
<div class="block">
    <div class="h2">Смотрите также:</div>
    <ol><b>

    <li><a href="http://geo-vlad.ru/perechen-meroprijatij-po-ohrane-okruzhajushhej-sredy-vladimir.php">Перечень мероприятий по охране окружающей среды ПМООС</a></li>
<li><a href="http://geo-vlad.ru/ocenka-vozdejstvija-na-okruzhajushhuju-sredu-ovos-vladimir.php">Оценка воздействия на окружающую среду ОВОС</a></li>
<li><a href="http://geo-vlad.ru/provedenie-ekologicheskoj-ekspertizy.php">Проведение экологической экспертизы</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskij-audit.php">Экологический аудит</a></li>
<li><a href="http://geo-vlad.ru/otchety-po-ekologii.php">Отчеты по экологии</a></li>
<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskie-laboratornye-issledovanija.php">Экологические лабораторные исследования</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskie-uslugi.php">Экологические услуги</a></li>
    </b></ol>
</div>
    
</div>


<script async type="application/ld+json">
{
  "@context": "http://schema.org/",
  "@type": "Product",
  "name": "Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области",
  "image": "http://geo-vlad.ru/images/ecology/6.jpg",
  "description": "Локальный экологический мониторинг, программа проведения производственного экологического контроля мониторинга окружающей среды - расценки во Владимирской области узнавайте в компании “Гео-Влад” по телефону +7(4922)22-20-12!",
    "brand": {
    "@type": "Organization",
    "name": "Гео-Влад"
  },
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "4.5",
    "reviewCount": "20"
  },
  "offers": {
    "@type": "Offer",
    "priceCurrency": "RUB",
    "price": "65000.00",
    "priceValidUntil": "2017-12-12",
    "availability": "http://schema.org/InStock",
    "seller": {
      "@type": "Organization",
      "name": "Гео-Влад"
    }
  }
}
</script>

<script async type="application/ld+json">
{ 
    "@context": "http://schema.org/", 
 "@type": "Article",
 "headline": "Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства&#8230;",
 "image": {
          "@type": "ImageObject",
           "contentUrl": "http://geo-vlad.ru/images/images/ecology/6.jpg",
           "url": "http://geo-vlad.ru/images/images/ecology/6.jpg",
           "height": "900",
           "width": "1200"
       },
 "author": "Гео-Влад", 
 "mainEntityOfPage": "http://geo-vlad.ru/ekologicheskij-monitoring-okruzhajushhej-sredy.php", 
  "publisher": {
      "@type": "Organization",
      "name": "Гео-Влад",
      "logo": {
          "@type": "ImageObject",
           "contentUrl": "http://geo-vlad.ru/images/logo.png",
           "url": "http://geo-vlad.ru/images/logo.png"
       }
    },
 "url": "http://geo-vlad.ru/ekologicheskij-monitoring-okruzhajushhej-sredy.php",
 "datePublished": "2017-03-28",
 "dateCreated": "2017-03-28",
 "dateModified": "2017-03-28",
 "description": "Локальный экологический мониторинг, программа проведения производственного экологического контроля мониторинга окружающей среды - расценки во Владимирской области узнавайте в компании “Гео-Влад” по телефону +7(4922)22-20-12!",
 "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "4.5",
    "reviewCount": "20"
  },
 "articleBody": "Что необходимо для проведения экологического мониторинга во Владимире и Владимирской области?
<p>Экологический контроль производится в нашей стране на основе проведения специального мониторинга. В общем речь идет об определенном анализе внешнего окружения. Для того, чтобы процедура отличалась правдоподобностью и правильностью оформления, рекомендуется обращаться к проверенным специалистам. ООО \'Гео Влад\' осуществляет экологический контроль и мониторинг во Владимире и Владимирской области. Что же именно подразумевает это исследование, и каковы его виды, основные отличия?</p>
<h2>Понятие экологического контроля и мониторинга</h2>
<p>Экологический мониторинг необходим для выявления проблем эколого-хозяйственного районирования, а также проверки правдивости и актуальности существующих данных об экологической ситуации территории. ООО \'Гео Влад\' предлагает экологический мониторинг окружающей среды во Владимире и Владимирской области. В наши обязанности будет входить составление наблюдения состояния окружающей среды, оценивание и прогнозирование ее будущего состояния в результате влияния определенных факторов, соответственно, выявление этих факторов и общее подсчитывание результатов.</p>
<p>Произведение всех работ должно осуществляться в соответствии с определенным алгоритмом, и требует заключения в виде правильного оформления документа. В связи с этим существует программа экологического мониторинга окружающей среды во Владимире и Владимирской области.</p>
<p>Какие пункты включает в себя эта программа?</p>
<ol>
<li>Параметрическую организацию экологического мониторинга (значения контроля содержания веществ в воздухе, грунте, воде).</li>
<li>Хорологисческую организацию мониторинга (перечень специфических, с точки зрения экологии, объектов).</li>
<li>Хронологическую организацию мониторинга (речь идет о частоте проведения проверок, наличие повторных исследований и так далее).</li>
<li>Приложения в виде разработанных карт, таблиц, схем.</li>
</ol>
<h3>Виды экологического мониторинга</h3>
<p>Для обследования определенного участка территории существует такое понятие, как локальный экологический мониторинг. К примеру, заказчик желает исследовать природоохранную территорию или зону экологического бедствия. Также может быть осмотрены лишь части какого-либо объекта.</p>
<p>Кроме того, существует такой вид мониторинга, как производственный контроль. Он предусматривает подтверждение (или опровержение) проводимости определенных действий касательно поддержания надлежащего состояния окружающей среды, принятие мер по улучшению этого состояния, а также приложение усилий к организации рационального пользования предоставленными природными ресурсами, соответствие предпринимаемых действий требованиям законодательства.</p>
<p>Программа производственного экологического контроля может включать следующие положения:</p>
<ul>
<li>инвентаризация выбросов в прилегающую окружающую среду (атмосферу, водные ресурсы, грунтовой покров);</li>
<li>инвентаризация объемов и мест концентрации отходов производства;</li>
<li>информация о должностных лицах, несущих ответственность за способ обращения с опасными для экологии отходами;</li>
<li>информация о наличии собственных исследовательских учреждений и соответствие их деятельности с законодательными положениями Российской Федерации;</li>
<li>данные о проводимых исследованиях территории, взятие проб и так далее.</li>
</ul>
<p>Сущность экологического мониторинга почв объясняет само название. Как правило, требуется для успешного проведения сельскохозяйственной деятельности в сфере аграрного бизнеса. В процессе составления результатов значения имеют факторы воздействия (биологические, химические, физические). Необходимо наличие следующей информации:</p>
<ul>
<li>доказательство контроля предприятия (фирмы, компании) за почвенным плодородием;</li>
<li>утверждение и применение мероприятий по улучшению состояния наиболее уязвимых сортов почвы;</li>
<li>прогнозирование состояния грунта, указание на влияние определенных факторов, которые могут поспособствовать тому или иному результату;</li>
<li>исследование малейших изменений земляного покрова;</li>
<li>рассмотрение влияния близлежащих грунтов и сравнение их состояний.</li>
</ul>
<p>В предпринимательской деятельности человек может столкнуться с экологическим мониторингом предприятия во Владимире и Владимирской области. Прежде всего, от учреждения требуется внедрение систем экологического менеджмента, что достигается путем предоставления таких документов:</p>
<ul>
<li>проекта лимита размещения отходов;</li>
<li>порядка и места их размещения;</li>
<li>проекта допустимых выбросов в соответствии с установленными нормами;</li>
<li>в случае произведения выбросов в водоемы - оговорить эти условия.</li>
</ul>
<p>На основе вышеперечисленных данных формируется программа производственного экологического контроля, мониторинга, с расценками которых вы можете ознакомится обратившись к нашему специалисту. В дальнейшем осуществляется непосредственный процесс мониторинга. Кроме того, каждый предприниматель должен иметь так называемый экологический паспорт, в котором также фиксируются данные о проведении производственного экологического мониторинга.</p>
<p>Что касается такой сферы, как строительство, то в этом плане также важно проведение правильных экологических исследований, и на их основе - работ.</p>
<h3>В каких случаях необходим экологический мониторинг строительства во Владимире и Владимирской области?</h3>
<ul>
<li>во время сооружения сетей коммуникаций;</li>
<li>во время строения как жилых, так и нежилых помещений;</li>
<li>в период прокладывания авто- и железных дорог;</li>
<li>в период обустройства общественных мест - парков, скверов и так далее.</li>
</ul>
<p>Расценка на вышеперечисленные услуги зависит от масштабов проводимых работ. С более детальной информацией вы можете ознакомиться, обратившись к нашим специалистам. Ждем ваших заказов!</p>
<p>Компания \'Гео-Влад\' проводит экологический мониторинг и прочие инженерные изыскания в городах:</p>
<ul>
<li>Муром (Муромский район);</li>
<li>Ковров (Ковровский район);</li>
<li>Вязники (Вязниковский район);</li>
<li>Кольчугино (Кольчугинский район);</li>
<li>Гусь-Хрустальный (Гусь-Хрустальный район);</li>
<li>Александров (Александровский район);</li>
<li>Радужный, Меленки (Меленсковский район);</li>
<li>Лакинск (Собинский район);</li>
<li>Карабаново (Александровский район);</li>
<li>Покров (Петушинский район);</li>
<li>Собинка (Собинский район);</li>
<li>Юрьев-Польский (Юрьев-Польский район).
</ul>"
 
 }
</script>

    
</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>
<script type="text/javascript">
    $(".big-button").magnificPopup();
</script>


</body>
</html>
	
</body>
</html>',
    '_isForward' => false,
  ),
  'contentType' => 
  array (
    'id' => 1,
    'name' => 'HTML',
    'description' => 'HTML content',
    'mime_type' => 'text/html',
    'file_extensions' => '.php',
    'headers' => NULL,
    'binary' => 0,
  ),
  'policyCache' => 
  array (
  ),
  'elementCache' => 
  array (
    '[[*pagetitle]]' => 'Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства во Владимире и Владимирской области',
    '[[*description]]' => 'Локальный экологический мониторинг, программа проведения производственного экологического контроля мониторинга окружающей среды - расценки во Владимирской области узнавайте в компании “Гео-Влад” по телефону +7(4922)22-20-12!',
    '[[getImageList? 
            &tvname=`dropdown-list`
            &docid=`1`
            &tpl=`@CODE:
					<li><a href="[[+url]]">[[+title]]</a></li>`
            ]]' => '
					<li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/geologiya-uchastka.php">Геология участка</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Инженерно-геодезические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-ekologicheskie-izyskanija-vladimir.php">Инженерно-экологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
					<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
					<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
					<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
					<li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы и услуги</a></li>
					<li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php">Уточнение и согласование границ земельного участка</a></li>
					<li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографо-геодезическая съемка</a></li>
					<li><a href="http://geo-vlad.ru/geodezicheskaja-razbivka-osej.php">Геодезическая разбивка осей</a></li>
					<li><a href="http://geo-vlad.ru/gidrogeologicheskie-izyskanija.php">Гидрогеологические и гидрометеорологические изыскания</a></li>
					<li><a href="burenie-skvazhin-na-pesok.php">Бурение на песок</a></li>',
    '[[$header]]' => '<link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            
					<li><a href="/#ingenerno-geologicheskie">Инженерно-геологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/geologiya-uchastka.php">Геология участка</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-geodezicheskie-izyskanija.php">Инженерно-геодезические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/inzhenerno-ekologicheskie-izyskanija-vladimir.php">Инженерно-экологические изыскания</a></li>
					<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
					<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
					<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
					<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
					<li><a href="http://geo-vlad.ru/kadastrovye-raboty-i-uslugi.php">Кадастровые работы и услуги</a></li>
					<li><a href="http://geo-vlad.ru/utochnenie-soglasovanie-granic-zemelnogo-uchastka.php">Уточнение и согласование границ земельного участка</a></li>
					<li><a href="http://geo-vlad.ru/topografo-geodezicheskaja-semka.php">Топографо-геодезическая съемка</a></li>
					<li><a href="http://geo-vlad.ru/geodezicheskaja-razbivka-osej.php">Геодезическая разбивка осей</a></li>
					<li><a href="http://geo-vlad.ru/gidrogeologicheskie-izyskanija.php">Гидрогеологические и гидрометеорологические изыскания</a></li>
					<li><a href="burenie-skvazhin-na-pesok.php">Бурение на песок</a></li>
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>',
    '[[*image]]' => 'images/ecology/6.jpg',
    '[[*id]]' => 53,
    '[[~53]]' => 'ekologicheskij-monitoring-okruzhajushhej-sredy.php',
    '[[*price]]' => '65000',
    '[[*offer]]' => '',
    '[[getImageList? 
            &tvname=`url-list`
            &tpl=`@CODE:
                    <li><a href="[[+url]]" title="[[+title]]">[[+title]]</a></li>`
            ]]' => '',
    '[[*list-text]]' => '<li><a href="http://geo-vlad.ru/perechen-meroprijatij-po-ohrane-okruzhajushhej-sredy-vladimir.php">Перечень мероприятий по охране окружающей среды ПМООС</a></li>
<li><a href="http://geo-vlad.ru/ocenka-vozdejstvija-na-okruzhajushhuju-sredu-ovos-vladimir.php">Оценка воздействия на окружающую среду ОВОС</a></li>
<li><a href="http://geo-vlad.ru/provedenie-ekologicheskoj-ekspertizy.php">Проведение экологической экспертизы</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskij-audit.php">Экологический аудит</a></li>
<li><a href="http://geo-vlad.ru/otchety-po-ekologii.php">Отчеты по экологии</a></li>
<li><a href="http://geo-vlad.ru/programma-ekologicheskogo-kontrolja.php">Программа экологического контроля</a></li>
<li><a href="http://geo-vlad.ru/razrabotka-ekologicheskoj-dokumentacii.php">Разработка экологической документации</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskoe-proektirovanie.php">Экологическое проектирование</a></li>
<li><a href="http://geo-vlad.ru/kompleksnoe-ekologicheskoe-soprovozhdenie.php">Комплексное экологическое сопровождение</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskie-laboratornye-issledovanija.php">Экологические лабораторные исследования</a></li>
<li><a href="http://geo-vlad.ru/ekologicheskie-uslugi.php">Экологические услуги</a></li>',
    '[[*rating]]' => '4.5',
    '[[*review]]' => '20',
    '[[*pagetitle:ellipsis=`100`]]' => 'Организация экологического контроля и мониторинга окружающей среды, почв, предприятия, строительства&#8230;',
    '[[~53? &scheme=`full`]]' => 'http://geo-vlad.ru/ekologicheskij-monitoring-okruzhajushhej-sredy.php',
    '[[*publishedon:strtotime:date=`%Y-%m-%d`]]' => '2017-03-28',
    '[[*content:replace=`"==\'`:strip_tags=`<p>,<h2>,<h3>,<ul>,<ol>,<li>`]]' => 'Что необходимо для проведения экологического мониторинга во Владимире и Владимирской области?
<p>Экологический контроль производится в нашей стране на основе проведения специального мониторинга. В общем речь идет об определенном анализе внешнего окружения. Для того, чтобы процедура отличалась правдоподобностью и правильностью оформления, рекомендуется обращаться к проверенным специалистам. ООО \'Гео Влад\' осуществляет экологический контроль и мониторинг во Владимире и Владимирской области. Что же именно подразумевает это исследование, и каковы его виды, основные отличия?</p>
<h2>Понятие экологического контроля и мониторинга</h2>
<p>Экологический мониторинг необходим для выявления проблем эколого-хозяйственного районирования, а также проверки правдивости и актуальности существующих данных об экологической ситуации территории. ООО \'Гео Влад\' предлагает экологический мониторинг окружающей среды во Владимире и Владимирской области. В наши обязанности будет входить составление наблюдения состояния окружающей среды, оценивание и прогнозирование ее будущего состояния в результате влияния определенных факторов, соответственно, выявление этих факторов и общее подсчитывание результатов.</p>
<p>Произведение всех работ должно осуществляться в соответствии с определенным алгоритмом, и требует заключения в виде правильного оформления документа. В связи с этим существует программа экологического мониторинга окружающей среды во Владимире и Владимирской области.</p>
<p>Какие пункты включает в себя эта программа?</p>
<ol>
<li>Параметрическую организацию экологического мониторинга (значения контроля содержания веществ в воздухе, грунте, воде).</li>
<li>Хорологисческую организацию мониторинга (перечень специфических, с точки зрения экологии, объектов).</li>
<li>Хронологическую организацию мониторинга (речь идет о частоте проведения проверок, наличие повторных исследований и так далее).</li>
<li>Приложения в виде разработанных карт, таблиц, схем.</li>
</ol>
<h3>Виды экологического мониторинга</h3>
<p>Для обследования определенного участка территории существует такое понятие, как локальный экологический мониторинг. К примеру, заказчик желает исследовать природоохранную территорию или зону экологического бедствия. Также может быть осмотрены лишь части какого-либо объекта.</p>
<p>Кроме того, существует такой вид мониторинга, как производственный контроль. Он предусматривает подтверждение (или опровержение) проводимости определенных действий касательно поддержания надлежащего состояния окружающей среды, принятие мер по улучшению этого состояния, а также приложение усилий к организации рационального пользования предоставленными природными ресурсами, соответствие предпринимаемых действий требованиям законодательства.</p>
<p>Программа производственного экологического контроля может включать следующие положения:</p>
<ul>
<li>инвентаризация выбросов в прилегающую окружающую среду (атмосферу, водные ресурсы, грунтовой покров);</li>
<li>инвентаризация объемов и мест концентрации отходов производства;</li>
<li>информация о должностных лицах, несущих ответственность за способ обращения с опасными для экологии отходами;</li>
<li>информация о наличии собственных исследовательских учреждений и соответствие их деятельности с законодательными положениями Российской Федерации;</li>
<li>данные о проводимых исследованиях территории, взятие проб и так далее.</li>
</ul>
<p>Сущность экологического мониторинга почв объясняет само название. Как правило, требуется для успешного проведения сельскохозяйственной деятельности в сфере аграрного бизнеса. В процессе составления результатов значения имеют факторы воздействия (биологические, химические, физические). Необходимо наличие следующей информации:</p>
<ul>
<li>доказательство контроля предприятия (фирмы, компании) за почвенным плодородием;</li>
<li>утверждение и применение мероприятий по улучшению состояния наиболее уязвимых сортов почвы;</li>
<li>прогнозирование состояния грунта, указание на влияние определенных факторов, которые могут поспособствовать тому или иному результату;</li>
<li>исследование малейших изменений земляного покрова;</li>
<li>рассмотрение влияния близлежащих грунтов и сравнение их состояний.</li>
</ul>
<p>В предпринимательской деятельности человек может столкнуться с экологическим мониторингом предприятия во Владимире и Владимирской области. Прежде всего, от учреждения требуется внедрение систем экологического менеджмента, что достигается путем предоставления таких документов:</p>
<ul>
<li>проекта лимита размещения отходов;</li>
<li>порядка и места их размещения;</li>
<li>проекта допустимых выбросов в соответствии с установленными нормами;</li>
<li>в случае произведения выбросов в водоемы - оговорить эти условия.</li>
</ul>
<p>На основе вышеперечисленных данных формируется программа производственного экологического контроля, мониторинга, с расценками которых вы можете ознакомится обратившись к нашему специалисту. В дальнейшем осуществляется непосредственный процесс мониторинга. Кроме того, каждый предприниматель должен иметь так называемый экологический паспорт, в котором также фиксируются данные о проведении производственного экологического мониторинга.</p>
<p>Что касается такой сферы, как строительство, то в этом плане также важно проведение правильных экологических исследований, и на их основе - работ.</p>
<h3>В каких случаях необходим экологический мониторинг строительства во Владимире и Владимирской области?</h3>
<ul>
<li>во время сооружения сетей коммуникаций;</li>
<li>во время строения как жилых, так и нежилых помещений;</li>
<li>в период прокладывания авто- и железных дорог;</li>
<li>в период обустройства общественных мест - парков, скверов и так далее.</li>
</ul>
<p>Расценка на вышеперечисленные услуги зависит от масштабов проводимых работ. С более детальной информацией вы можете ознакомиться, обратившись к нашим специалистам. Ждем ваших заказов!</p>
<p>Компания \'Гео-Влад\' проводит экологический мониторинг и прочие инженерные изыскания в городах:</p>
<ul>
<li>Муром (Муромский район);</li>
<li>Ковров (Ковровский район);</li>
<li>Вязники (Вязниковский район);</li>
<li>Кольчугино (Кольчугинский район);</li>
<li>Гусь-Хрустальный (Гусь-Хрустальный район);</li>
<li>Александров (Александровский район);</li>
<li>Радужный, Меленки (Меленсковский район);</li>
<li>Лакинск (Собинский район);</li>
<li>Карабаново (Александровский район);</li>
<li>Покров (Петушинский район);</li>
<li>Собинка (Собинский район);</li>
<li>Юрьев-Польский (Юрьев-Польский район).
</ul>',
    '[[$footer]]' => '</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>',
  ),
  'sourceCache' => 
  array (
    'modChunk' => 
    array (
      'header' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'header',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            [[getImageList? 
            &tvname=`dropdown-list`
            &docid=`1`
            &tpl=`@CODE:
					<li><a href="[[+url]]">[[+title]]</a></li>`
            ]]
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<link href="/css/bootstrap.css" type="text/css" rel="stylesheet" media="all">
<link rel="stylesheet" href="/css/magnific-popup.css" media="all" type="text/css">
	<link href="/css/style.css" type="text/css" rel="stylesheet" media="all">
	
	<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
	
	<!-- reCAPTCHA -->
<script type="text/javascript">

     //reCaptcha
    var resHome = 0;
    var resFooter = 0;
    var resContact = 0;
    function validateFormHome(){
         if (resHome!=1)
             {
              return false;
             } else {
                 resHome=0;
            };
        };
    var callbackHome = function (){
        resHome=1;

        };
        
    function validateFormFooter(){
        
         if (resFooter!=1)
             {
              return false;
             } else {
                 resFooter=0;
                };
        };
    var callbackFooter = function (){
        resFooter=1;
        
        };
        
    function validateFormContact(){
         if (resContact!=1)
             {
              return false;
             } else {
                 resContact=0;
            };
        };
    var callbackContact = function (){
        resContact=1;

        };
        
      var widgetCapthaFooter;
      var widgetCapthaHome;
      var widgetCapthaContact;
      var onloadCallback = function() {
         
        widgetCapthaFooter = grecaptcha.render(document.getElementById(\'footerCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'theme\' : \'dark\',
          \'size\' : \'compact\',
          \'callback\' : callbackFooter
        });
        
        
        
        if  (document.getElementById(\'homeCaptcha\')!==null){
        widgetCapthaHome = grecaptcha.render(document.getElementById(\'homeCaptcha\'), {
          \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
          \'callback\' : callbackHome      
        });
        };
        
        if  (document.getElementById(\'contactCaptcha\')!==null){
        widgetCapthaContact = grecaptcha.render(document.getElementById(\'contactCaptcha\'), {
                \'sitekey\' : \'6LdwTTQUAAAAAEfaO3P7sWSBQler3_v-jC42U1fM\',
                \'callback\' : callbackContact
        });
        };
        
      };
</script>

</head>
<body>
<header>
<nav class="navbar navbar-inverse navbar-fixed-top">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#myNavbar">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>                        
      </button>
      <div class="navbar-brand"><a href="/"><div class="header-logo"><img src="/images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div></a></div>
      <div class="navbar-text header-phone" ><a href="tel:74922222012"><span class="glyphicon glyphicon-earphone"></span> (4922) 22-20-12</a>
      </div>
    </div>
    <div class="collapse navbar-collapse" id="myNavbar">
      <ul class="nav navbar-nav">
        <li><a href="/">ГЛАВНАЯ</a></li>
        <li><a href="/ceny.php">ЦЕНЫ</a></li>
        <li><a href="/o-nas.php">О НАС</a></li>
        <li class="dropdown">
        <a class="dropdown-toggle" data-toggle="dropdown" href="#">УСЛУГИ
        <span class="caret"></span></a>
        <ul class="dropdown-menu">
            [[getImageList? 
            &tvname=`dropdown-list`
            &docid=`1`
            &tpl=`@CODE:
					<li><a href="[[+url]]">[[+title]]</a></li>`
            ]]
          
          <li class="divider"></li>
          <li><a href="uslugi.php">ВСЕ УСЛУГИ</a></li>
         </ul>
      </li>
        
        
        <li><a href="/contacts.php">КОНТАКТЫ</a></li>
      </ul>
     
     <div class="navbar-text" style="float:right"><a href="mailto:geo-vlad17@yandex.ru"><span class="glyphicon glyphicon-envelope"></span>  geo-vlad17@yandex.ru</a></div>

    </div>
  </div>
</nav>
</header>
<main>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'footer' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'footer',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '</main>

<footer>	
		<div class="container">
		<div class="row">
			<div class="col-md-4 col-md-push-2" itemscope itemtype="http://schema.org/Organization">
				<meta itemprop="name" content="ГеоВлад">
				    <link itemprop="url" href="http://geo-vlad.ru">
					
					<div class="footer-logo" ><img src="images/logo_white.png" alt="ГеоВлад" title="ГеоВлад"></div> 
                         
						<ul class=\'footer-contacts\'> 
						<li itemprop="address" itemscope itemtype="http://schema.org/PostalAddress">
						    <meta itemprop="addressCountry" content="Россия">
							<meta itemprop="addressRegion" content="Владимирская область">
							<span class="glyphicon glyphicon-map-marker" aria-hidden="true">
							</span>
						    <span itemprop="addressLocality">г. Владимир</span>, <span itemprop="streetAddress">ул. Разина, 21, оф. 301</span>
							</li>
							<li ><span class="glyphicon glyphicon-time" aria-hidden="true">
							</span> Пн-Сб 08.00-19.00</li>							
							<li>
							<span class="glyphicon glyphicon-earphone" aria-hidden="true">
							</span>
							<span><a href="tel:+74922222012" itemprop="telephone">+7 (4922) 22-20-12</a>
							</span>
							</li>
							<li>
							<span class="glyphicon glyphicon-envelope" aria-hidden="true">
							</span>
							<a href="mailto:geo-vlad17@yandex.ru">
							<span itemprop="email">geo-vlad17@yandex.ru	</span>
							</a>
							
							</li>
						</ul>
					
					</div>

				
	
				<div class="col-md-4 col-md-push-2">
				<div class="h3 footer-title">Задайте вопрос</div>
				  				  <div class="footer-form">
				  	 <form id="footer-form" action="action-mail.php" method="post" enctype="multipart/form-data" onsubmit="return validateFormFooter()">
                          <div class="form-group">
                             <label class="control-label">Ваше Имя<sup>*</sup></label>
                                  <div class="footer-input-group">

                                    <span class="glyphicon glyphicon-user pos" aria-hidden="true"></span><input type="text" placeholder="Иван Иванов" name="name" class="form-control" required>
                                  </div>
                                  <label class="control-label">Как с вами связаться:</label>
                                  <div class="footer-input-group">
                                    <span class="glyphicon glyphicon-envelope pos" aria-hidden="true"></span><input type="text" placeholder="Ваш e-mail" name="email" class="form-control">
                                  </div>
                                  <div class="footer-input-group">
                                   <span class="glyphicon glyphicon-earphone pos" aria-hidden="true"></span><input type="text" placeholder="Номер телефона" class="form-control" name="phone">
                                  </div>
                                </div>
                                <div class="form-group">
                                  <label class="control-label">Текст сообщения<sup>*</sup></label>
                                  <div class="footer-input-group">
                                    <textarea name="question" form="footer-form" id="contact-form-textarea" placeholder="Ваш вопрос" required></textarea>
                                  </div>
                                </div>
                                <div id="footerCaptcha"></div>
                                <div style="text-align:center"><input type="submit" value="Отправить">   
                            </div>      
                              </form>
                    </div>
				  </div>
				

		</div>
		</div>
	</footer>
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300,700|PT+Sans:400,400i,700&amp;subset=cyrillic" rel="stylesheet">
    <script src="https://use.fontawesome.com/01c5d59dc9.js"></script>
    <script type="text/javascript" src="/js/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="/js/jquery.magnific-popup.min.js"></script>
    <script type="text/javascript" src="/js/script.js"></script>
    <script src="https://www.google.com/recaptcha/api.js?onload=onloadCallback&render=explicit" async defer></script>
    
    
<script>
$(document).ready(function() {
	$(".item-lib").magnificPopup({
		type: \'image\',
		gallery : {
			enabled: true
		},
		removalDelay: 300,
		mainClass: \'mfp-fade\'

	});
});
</script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript">
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter41879414 = new Ya.Metrika({
                    id:41879414,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/watch.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/41879414" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'https://www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-90227768-1\', \'auto\');
  ga(\'send\', \'pageview\');

</script>

<script type="text/javascript">
var ZCallbackWidgetLinkId  = \'12ace767b09d603512f370af7cc98407\';
var ZCallbackWidgetDomain  = \'my.zadarma.com\';
(function(){
    var lt = document.createElement(\'script\');
    lt.type =\'text/javascript\';
    lt.charset = \'utf-8\';
    lt.async = true;
    lt.src = \'https://\' + ZCallbackWidgetDomain + \'/callbackWidget/js/main.min.js?unq=\'+Math.floor(Math.random(0,1000)*1000);
    var sc = document.getElementsByTagName(\'script\')[0];
    if (sc) sc.parentNode.insertBefore(lt, sc);
    else document.documentElement.firstChild.appendChild(lt);
})();
</script>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modSnippet' => 
    array (
      'getImageList' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'getImageList',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\',$inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }
        
        if (empty($outputvalue)){
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)){
                foreach ($inheritFrom as $from){
                    if ($from == \'parents\'){
                        $outputvalue = $tv->processInheritBinding(\'\',$docid);
                    }else{
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)){
                        break;
                    }                    
                }
            }
        }

       
        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)){
            $migx->source->initialize();
        }
        
    }


}

if (empty($outputvalue)) {
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\',$inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }
        
        if (empty($outputvalue)){
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)){
                foreach ($inheritFrom as $from){
                    if ($from == \'parents\'){
                        $outputvalue = $tv->processInheritBinding(\'\',$docid);
                    }else{
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)){
                        break;
                    }                    
                }
            }
        }

       
        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)){
            $migx->source->initialize();
        }
        
    }


}

if (empty($outputvalue)) {
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
    ),
    'modTemplateVar' => 
    array (
      'image' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'image',
          'caption' => 'Путь к картинке для статьи',
          'description' => 'Инженерно-геологические изыскания для строительства',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => 'bg1.jpg',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => 'bg1.jpg',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'price' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'number',
          'name' => 'price',
          'caption' => 'Цена услуги',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '24000',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'allowDecimals' => 'Да',
            'allowNegative' => 'Нет',
            'decimalPrecision' => '2',
            'decimalSeparator' => '.',
            'maxValue' => '',
            'minValue' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '24000',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'offer' => 
      array (
        'fields' => 
        array (
          'id' => 13,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'offer',
          'caption' => 'Спецпредложение',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'maxLength' => '',
            'minLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'list-text' => 
      array (
        'fields' => 
        array (
          'id' => 6,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'list-text',
          'caption' => 'HTML-код для списка ссылок на статьи',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'rating' => 
      array (
        'fields' => 
        array (
          'id' => 3,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'listbox',
          'name' => 'rating',
          'caption' => 'Рейтинг от 0 до 5',
          'description' => 'Любое значение от 4 до 5',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '4.1||4.2||4.3||4.4||4.5||4.6||4.7||4.8||4.9
',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '4.5',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'listWidth' => '',
            'title' => '',
            'typeAhead' => 'false',
            'typeAheadDelay' => '250',
            'forceSelection' => 'false',
            'listEmptyText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '4.5',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'review' => 
      array (
        'fields' => 
        array (
          'id' => 4,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'number',
          'name' => 'review',
          'caption' => 'Количество отзывов',
          'description' => 'Любое целое число от 10 до 40',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '27',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'allowDecimals' => 'Нет',
            'allowNegative' => 'Нет',
            'decimalPrecision' => '2',
            'decimalSeparator' => '.',
            'maxValue' => '40',
            'minValue' => '10',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '27',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
  ),
);